[
  {
    "id": "A&A",
    "description": "The Audit and Assurance (A&A) domain enables CSPs and CSCs to inform and establish necessary confidence for critical decision-making, communication, and reporting about key processes—including those control processes encompassed within the CCM—through assessment, verification, and validation activities. This domain is designed to support the CSP and CSC in defining and implementing their respective audit management processes to support audit planning, risk analysis, security control assessment, conclusion, remediation, and reporting as well as their review of and reliance on attestations and supporting evidence."
  },
  {
    "id": "AIS",
    "description": "The Application and Interface Security (AIS) domain focuses on securing software and interfaces used in the cloud, assisting organizations in identifying and mitigating risks to cloud landscapes in the application’s design and development phase. Implementing cloud security controls in this domain is crucial for a CSP to ensure the integrity, confidentiality, and availability of the applications and interfaces within their cloud environment."
  },
  {
    "id": "BCR",
    "description": "The Business Continuity Management and Operational Resilience (BCR) domain focuses on safeguarding critical business processes, infrastructure, and services, minimizing the impact of disruptions, and ensuring business continuity in the face of potentially disruptive events. Implementation of cloud security controls in this domain is paramount for both CSPs and CSCs to ensure uninterrupted service delivery and maintain operational resilience."
  },
  {
    "id": "CCC",
    "description": "The Change Control and Configuration Management (CCC) domain focuses on managing and securing changes to the cloud environment, ensuring that modifications do not introduce vulnerabilities or compromise the security of systems in the cloud environment. Effectively managing changes is vitally important to ensure a stable and secure cloud service is maintained, both for the CSPs and the CSCs."
  },
  {
    "id": "CEK",
    "description": "The Cryptography, Encryption and Key Management (CEK) domain aims to protect the CSCs’ data by employing cryptographic techniques, encryption, and key management practices. The CEK domain plays a crucial role in ensuring compliance with encryption and key management requirements of various regulatory standards, facilitating the confidentiality and integrity of sensitive information in the cloud environment."
  },
  {
    "id": "DCS",
    "description": "This Datacenter Security (DCS) domain provides for CSPs to secure the physical infrastructure and environment of the CSP that hosts the data and applications of the CSCs. This includes safeguarding physical assets, such as physical infrastructure and equipment against security threats such as unauthorized access and environmental hazards."
  },
  {
    "id": "DSP",
    "description": "The Data Security and Privacy Lifecycle Management (DSP) domain features controls on privacy and data security. These controls are not industry or sector-specific and are not focused on a particular country or regulation. However, these controls have been developed by considering the common elements and requirements of major privacy regulations. They are generally applicable to organizations worldwide and are expected to serve as a valuable baseline—with the caveat that some organizations operating in some locations or sectors may have to implement supplemental data protection controls."
  },
  {
    "id": "GRC",
    "description": "The Governance, Risk Management, and Compliance (GRC) domain helps CSPs and CSCs ensure their information governance and associated enterprise risk management (ERM), information security management, and compliance management programs adequately address cloud offerings and concerns."
  },
  {
    "id": "HRS",
    "description": "The Human Resources (HRS) security domain aids cloud organizations in managing the risk associated with insider threats and ensures that personnel handling sensitive data are trustworthy and properly trained. Effective HRS measures safeguard against unauthorized access and data breaches caused by human factors, thus maintaining the overall security posture."
  },
  {
    "id": "IAM",
    "description": "The Identity and Access Management (IAM) domain features controls for helping both CSPs and CSCs adhering to security best practices in managing identities and access to security functions and data in the cloud environment. Best practices such as the principle of least privilege, segregation of duties, multi-factor authentication, role based and attribute based access control are central to managing access to cloud resources."
  },
  {
    "id": "IPY",
    "description": "The Interoperability and Portability (IPY) domain addresses interoperability and portability in the cloud environment. Implementing robust interoperability and portability controls facilitates the safe and secure exchange of data across multiple platforms and CSPs, enabling CSCs to avoid vendor lock-in and fostering an environment where interoperability and portability are not hindered by security concerns."
  },
  {
    "id": "IVS",
    "description": "The Infrastructure and Virtualization Security (IVS) domain guides CSPs and CSCs in implementing controls to secure infrastructure and virtualization technologies. Infrastructure encompasses all hardware, software, networks, facilities, etc., required to deliver IT services. Virtualization technologies use software to create an abstraction layer over computer hardware that allows the hardware elements (such as processors, memory, storage, etc.) to be divided into virtual computers."
  },
  {
    "id": "LOG",
    "description": "The Logging and Monitoring (LOG) domain aids CSPs and CSCs in collecting, storing, analyzing and reporting on the activities and events that occur in their cloud environment. This in turn helps to detect and respond to security incidents, operational issues and system anomalies, comply with regulatory requirements, audit and verify the effectiveness of their security controls, and improve their security posture and performance."
  },
  {
    "id": "SEF",
    "description": "The Security Incident Management, E-Discovery, and Cloud Forensics (SEF) domain controls support effectively managing and responding to security incidents, conducting e-discovery, and performing forensics in the cloud. The controls help CSPs and CSCs for timely detection, analysis, and response to security incidents, minimizing the impact on business operations."
  },
  {
    "id": "STA",
    "description": "The Supply Chain Management, Transparency, and Accountability (STA) domain aids cloud parties in delineating a broad set of supply chain risk management controls, such as managing the SSRM between the CSPs and the CSCs. These controls enable third-party providers to employ appropriate security measures to protect the confidentiality, integrity, and availability of information, applications, and services across the full technology stack. These controls also help manage security and regulatory compliance across the supply chain."
  },
  {
    "id": "TVM",
    "description": "The Threat and Vulnerability Management (TVM) domain helps both CSPs and CSCs to proactively identify and mitigate security threats and vulnerabilities in the cloud environment that may evolve and impact assets, security architectures, designs, and solution components."
  },
  {
    "id": "UEM",
    "description": "The Universal Endpoint Management (UEM) domain focuses on implementing controls to mitigate the risks associated with endpoints, including mobile devices. The risk with mobile computing and endpoint security mainly relates to user behavior and the awareness (or lack of awareness) of a company’s approach to acceptable use of devices and technologies (e.g., managed vs. unmanaged, enterprise-owned vs. personal)."
  }
]
