[
    {
        "id": "PR.PS-06.05 ",
        "description": "A software security testing and validation strategy is developed and implemented in the development lifecycle of all software projects, defining testing requirements and plans; performing/automating testing, vulnerability scanning, and migration activities; and supporting code integrity verification (e.g., using digital signatures)."
    },
    {
        "id": "PR.AA-02.01",
        "description": "The organization authenticates identity, validates the authorization level of a user before granting access to its systems, limits the use of an account to a single individual, and attributes activities to the user in logs and transactions."
    },
    {
        "id": "PR.AA-05.01",
        "description": "The organization limits access privileges to the minimum necessary and with consideration of separation of duties (e.g., through role-based access control, asset owner access recertifications, etc.)."
    },
    {
        "id": "PR.AA-04.01",
        "description": "Access credential and authorization mechanisms for internal systems and across security perimeters (e.g., leveraging directory services, directory synchronization, single sign-on, federated access, credential mapping, etc.) are designed to maintain security, integrity, and authenticity."
    },
    {
        "id": "DE.CM-09.02",
        "description": "The organization uses integrity checking mechanisms to verify hardware integrity."
    },
    {
        "id": "DE.CM-01.04",
        "description": "The organization has policies, procedures, and tools in place to monitor for, detect, and block access from/to devices that are not authorized or do not conform to security policy (e.g., unpatched systems)."
    },
    {
        "id": "DE.CM-01.03",
        "description": "The organization has policies, procedures, and tools in place to monitor for, detect, and block unauthorized network connections and data transfers."
    },
    {
        "id": "PR.DS-02.01",
        "description": "Data-in-transit is protected commensurate with the criticality and sensitivity of the information and in alignment with the data classification and protection policy (e.g., through the use of encryption, authentication, access control, masking, tokenization, and alternate transit paths)."
    },
    {
        "id": "ID.RA-01.03",
        "description": "The organization establishes and maintains standards and capabilities for ongoing vulnerability management, including systematic scans, or reviews reasonably designed to identify known cyber vulnerabilities and upgrade opportunities, across the organization's environments and assets."
    },
    {
        "id": "PR.DS-01.03",
        "description": "The organization defines and implements controls for the protection and use of removable media (e.g., access/use restrictions, encryption, malware scanning, data loss prevention, etc.)"
    },
    {
        "id": "PR.AA-03.03",
        "description": "The organization reduces fraudulent activity and protects reputational integrity through email verification mechanisms (e.g., DMARC, DKIM), call-back verification, secure file exchange facilities, out-of-band communications, customer outreach and education, and other tactics designed to thwart imposters and fraudsters."
    },
    {
        "id": "PR.DS-01.02",
        "description": "The organization implements data loss identification and prevention tools to monitor and protect against confidential data theft or destruction by an employee or an external actor."
    },
    {
        "id": "PR.PS-06.05",
        "description": "A software security testing and validation strategy is developed and implemented in the development lifecycle of all software projects, defining testing requirements and plans; performing/automating testing, vulnerability scanning, and migration activities; and supporting code integrity verification (e.g., using digital signatures)."
    },
    {
        "id": "PR.DS-01.01",
        "description": "Data-at-rest is protected commensurate with the criticality and sensitivity of the information and in alignment with the data classification and protection policy (e.g., through the use of encryption, authentication, access control, segregation, masking, tokenization, and file integrity monitoring)."
    }
]
