[
    {
        "id": "GV.OC-01.01",
        "description": "Technology and cybersecurity strategies, architectures, and programs are formally governed to align with and support the organization's mission, objectives, priorities, tactical initiatives, and risk profile."
    },
    {
        "id": "GV.OC-02.01",
        "description": "The organization's obligation to its customers, employees, and stakeholders to maintain safety and soundness, while balancing size and complexity, is reflected in the organization's risk management strategy and framework, its risk appetite and risk tolerance statements, and in a risk-aware culture."
    },
    {
        "id": "GV.OC-02.02",
        "description": "Technology and cybersecurity risk management strategies identify and communicate the organization’s role within the financial services sector as a component of critical infrastructure."
    },
    {
        "id": "GV.OC-02.03",
        "description": "Technology and cybersecurity risk management strategies identify and communicate the organization's role as it relates to other critical infrastructure sectors outside of the financial services sector and the interdependency risks."
    },
    {
        "id": "GV.OC-03.01",
        "description": "The organization's technology and cybersecurity strategy, framework, and policies align and are consistent with the organization's legal, statutory, contractual, and regulatory obligations and ensure that compliance responsibilities are unambiguously assigned."
    },
    {
        "id": "GV.OC-03.02",
        "description": "The organization implements and maintains a documented policy or policies that address customer data privacy that is approved by a designated officer or the organization’s appropriate governing body (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.OC-04.01",
        "description": "The organization maintains an inventory of key internal assets, business functions, and external dependencies that includes mappings to other assets, business functions, and information flows."
    },
    {
        "id": "GV.OC-04.02",
        "description": "The organization documents the business processes that are critical for the delivery of services and the functioning of the organization, and the impacts to the business if those processes are degraded or not functioning."
    },
    {
        "id": "GV.OC-04.03",
        "description": "Resilience requirements to support the delivery of critical services are established for all operating states (e.g., under duress/attack, during recovery, and normal operations)."
    },
    {
        "id": "GV.OC-04.04",
        "description": "The organization prioritizes the resilience design, planning, testing, and monitoring of systems and other key internal and external dependencies according to their criticality to the supported business functions, enterprise mission, and to the financial services sector."
    },
    {
        "id": "GV.OC-05.01",
        "description": "The organization identifies, assesses, and documents the key dependencies, interdependencies, and potential points of failure to support the delivery of critical services (e.g., systems, business processes, workforce, third parties, facilities, etc.)"
    },
    {
        "id": "GV.OC-05.02",
        "description": "The organization has prioritized its external dependencies according to their criticality to the supported enterprise mission, business functions, and to the financial services sector."
    },
    {
        "id": "GV.OC-05.03",
        "description": "The organization defines objectives (e.g., Recovery Time Objective, Maximum Tolerable Downtime, Impact Tolerance) for the resumption of critical operations in alignment with business imperatives, stakeholder obligations, and critical infrastructure dependencies."
    },
    {
        "id": "GV.OC-05.04",
        "description": "Recovery point objectives to support data integrity are consistent with the organization's recovery time objectives, information flow dependencies between systems, and business obligations."
    },
    {
        "id": "GV.RM-01.01",
        "description": "Technology and cybersecurity risk management strategies and frameworks are approved by the governing authority (e.g., the Board or one of its committees) and incorporated into the overall business strategy and enterprise risk management framework."
    },
    {
        "id": "GV.RM-01.02",
        "description": "Technology and cybersecurity risk management strategies and frameworks are informed by applicable international, national, and financial services industry standards and guidelines."
    },
    {
        "id": "GV.RM-01.03",
        "description": "The organization has established, and maintains, technology and cybersecurity programs designed to protect the confidentiality, integrity and availability of its information and operational systems, commensurate with the organization's risk appetite and business needs."
    },
    {
        "id": "GV.RM-01.04",
        "description": "Technology and cybersecurity risk management programs incorporate risk identification, measurement, monitoring, and reporting."
    },
    {
        "id": "GV.RM-01.05",
        "description": "The organization's technology, cybersecurity, resilience, and third-party risk management programs, policies, resources, and priorities are aligned and mutually supporting."
    },
    {
        "id": "GV.RM-02.01",
        "description": "The governing authority (e.g., the Board or one of its committees) endorses and regularly reviews technology and cybersecurity risk appetite and is regularly informed about the status of, and material changes to, the organization's inherent risk profile."
    },
    {
        "id": "GV.RM-02.02",
        "description": "The organization has established statements of technology and cybersecurity risk tolerance consistent with its risk appetite, and has integrated them into technology, cybersecurity, operational, and enterprise risk management practices."
    },
    {
        "id": "GV.RM-02.03",
        "description": "Determination of the organization's risk appetite and tolerance includes consideration of the organization's stakeholder obligations, role in critical infrastructure, and sector-specific risk analysis."
    },
    {
        "id": "GV.RM-03.01",
        "description": "Technology and cybersecurity risk management frameworks and programs are integrated into the enterprise risk management framework."
    },
    {
        "id": "GV.RM-03.02",
        "description": "The organization's business continuity and resilience strategy and program align with and support the overall enterprise risk management framework."
    },
    {
        "id": "GV.RM-03.03",
        "description": "Technology and cybersecurity risk management and risk assessment processes are consistent with the organization's enterprise risk management policies, procedures, and methodologies and include criteria for the evaluation and categorization of enterprise-specific risks and threats."
    },
    {
        "id": "GV.RM-03.04",
        "description": "Technology and cybersecurity risk management considerations are integrated into daily operations, cultural norms, management discussions, and management decision-making, and are tailored to address enterprise-specific risks (both internal and external)."
    },
    {
        "id": "GV.RM-04.01",
        "description": "The governing authority (e.g., the Board or one of its committees) and senior management provide guidance, direction, and credible challenge in the design and implementation of risk management strategies, assessment of identified risks against risk appetite and risk tolerance, and in the selection of risk treatment approaches."
    },
    {
        "id": "GV.RM-05.01",
        "description": "The organization has a process for monitoring its technology, cybersecurity, and third-party risks, including escalating those risks that exceed risk appetite to management and identifying risks with the potential to impact multiple operating units."
    },
    {
        "id": "GV.RM-05.02",
        "description": "The organization establishes minimum requirements for its third-parties that include how the organizations will communicate and coordinate in times of emergency, including"
    },
    {
        "id": "GV.RM-06.01",
        "description": "Technology and cybersecurity risk management and risk assessment processes and methodologies are documented and regularly reviewed and updated to address changes in the risk profile and risk appetite, the evolving threat environment, and new technologies, products, services, and interdependencies."
    },
    {
        "id": "GV.RM-07.01",
        "description": "The organization has mechanisms in place to ensure that strategies, initiatives, opportunities, and emerging technologies (e.g., artificial intelligence, quantum computing, etc.) are evaluated both in terms of risks and uncertainties that are potentially detrimental to the organization, as well as potentially advantageous to the organization (i.e., positive risks)."
    },
    {
        "id": "GV.RM-08.01",
        "description": "Technology and cybersecurity risk management frameworks are applied to, and are adapted as needed by, the organization's innovations in technology use and adoption of emerging technologies."
    },
    {
        "id": "GV.RM-08.02",
        "description": "Technology and cybersecurity risk management frameworks are applied to all technology projects and procurements to ensure that security requirements (e.g., data confidentiality, access control, event logging, etc.) are addressed consistently from project onset."
    },
    {
        "id": "GV.RM-08.03",
        "description": "The organization defines, maintains, and uses technical security standards, architectures, processes or practices (including automated tools when practical) to ensure the security of its applications and infrastructure."
    },
    {
        "id": "GV.RM-08.04",
        "description": "The organization integrates the use of technology architecture in its governance processes to support consistent approaches to security and technology design, integration of third party services, consideration and adoption of new technologies, and investment and procurement decisioning."
    },
    {
        "id": "GV.RM-08.05",
        "description": "The technology architecture and associated management processes should be comprehensive (e.g., consider the full life cycle of infrastructure, applications, emerging technologies, and relevant data) and designed to achieve security and resilience commensurate with business needs."
    },
    {
        "id": "GV.RM-08.06",
        "description": "Technology programs and projects are formally governed and stakeholder engagement is managed to facilitate effective communication, awareness, credible challenge, and decision-making."
    },
    {
        "id": "GV.RM-08.07",
        "description": "Technology projects follow an established project management methodology to manage delivery and delivery risks, produce consistent quality, and achieve business objectives and value."
    },
    {
        "id": "GV.RM-09.01",
        "description": "The organization has an enterprise-wide resilience strategy and program, including architecture, cyber resilience, business continuity, disaster recovery, and incident response, which support its mission, stakeholder obligations, critical infrastructure role, and risk appetite."
    },
    {
        "id": "GV.RM-09.02",
        "description": "The resilience program ensures that the organization can continue operating critical business functions and deliver services to stakeholders, to include critical infrastructure partners, during adverse incidents and cyber attacks (e.g., propagation of malware or extended system outages)."
    },
    {
        "id": "GV.RR-01.01",
        "description": "The governing authority (e.g., the Board or one of its committees) oversees and holds senior management accountable for implementing the organization’s technology and cybersecurity risk management strategies and frameworks."
    },
    {
        "id": "GV.RR-01.02",
        "description": "The governing authority (e.g., the Board or one of its committees) regularly reviews, oversees, and holds senior management accountable for implementing the organization’s third-party risk management strategy and program and for managing the organization's ongoing risks associated with the aggregate and specific use of third parties."
    },
    {
        "id": "GV.RR-01.03",
        "description": "The governing authority (e.g., the Board or one of its committees) regularly reviews, oversees, and holds senior management accountable for implementing the organization’s resilience strategy and program and for managing the organization's ongoing resilience risks."
    },
    {
        "id": "GV.RR-01.04",
        "description": "The organization has designated a qualified Cybersecurity Officer (e.g., CISO) who is responsible and accountable for developing a cybersecurity strategy, overseeing and implementing its cybersecurity program, and enforcing its cybersecurity policy."
    },
    {
        "id": "GV.RR-01.05",
        "description": "The organization designates a qualified Technology Officer (e.g., CIO or CTO) who is responsible and accountable for developing technology strategy, overseeing and implementing its technology program, and enforcing its technology policy."
    },
    {
        "id": "GV.RR-02.01",
        "description": "The roles, responsibilities, qualifications, and skill requirements for personnel (employees and third parties) that implement, manage, and oversee the technology, cybersecurity, and resilience programs are defined, aligned, coordinated, and holistically managed."
    },
    {
        "id": "GV.RR-02.02",
        "description": "The organization has established and assigned roles and responsibilities for systematic cybersecurity threat identification, monitoring, detection, and event reporting processes, and ensures adequate coverage and organizational alignment for these functions."
    },
    {
        "id": "GV.RR-02.03",
        "description": "Resilience program roles and responsibilities are assigned to management across the organization to ensure risk assessment, planning, testing, and execution coverage for all critical business functions."
    },
    {
        "id": "GV.RR-02.04",
        "description": "Roles and responsibilities for the Third-Party Risk Management Program and for each third-party engagement are defined and assigned."
    },
    {
        "id": "GV.RR-02.05",
        "description": "Personnel (employees and third parties) who fulfill the organization’s physical security and cybersecurity objectives understand their roles and responsibilities."
    },
    {
        "id": "GV.RR-02.06",
        "description": "Roles and responsibilities for the inventory, ownership, and custodianship of applications, data and other technology assets are established and maintained."
    },
    {
        "id": "GV.RR-02.07",
        "description": "Technology and cybersecurity risk management frameworks provide for segregation of duties between policy development, implementation, and oversight."
    },
    {
        "id": "GV.RR-03.01",
        "description": "The organization's budgeting and resourcing processes identify, prioritize, and address resource needs to manage identified technology and cybersecurity risks (e.g., skill shortages, headcount, new tools, incident-related expenses, and unsupported systems)."
    },
    {
        "id": "GV.RR-03.02",
        "description": "The organization regularly assesses its skill and resource level requirements against its current personnel complement to determine gaps in resource need."
    },
    {
        "id": "GV.RR-03.03",
        "description": "The organization provides adequate resources, appropriate authority, and access to the governing authority for the designated Cybersecurity Officer (e.g., CISO)."
    },
    {
        "id": "GV.RR-04.01",
        "description": "The organization conducts (or causes the conduct of) background/screening checks on all personnel (employees and third party) upon hire/retention, at regular intervals throughout employment, and upon a change in role commensurate with their access to critical data and systems."
    },
    {
        "id": "GV.RR-04.02",
        "description": "The organization establishes processes and controls to mitigate cyber risks related to employment termination, as permitted by law, to include the return or disposition of all organizational assets."
    },
    {
        "id": "GV.RR-04.03",
        "description": "The organization integrates insider threat considerations into its human resource, risk management, and control programs to address the potential for malicious or unintentional harm by trusted employees or third parties."
    },
    {
        "id": "GV.PO-01.01",
        "description": "Technology and cybersecurity policies are documented, maintained and approved by the governing authority (e.g., the Board or one of its committees) or a designated executive."
    },
    {
        "id": "GV.PO-01.02",
        "description": "The accountable governing body, and applicable cybersecurity program and policies, for any given organizational unit, affiliate, or merged entity are clearly established, applied, and communicated."
    },
    {
        "id": "GV.PO-01.03",
        "description": "The organization's incentive programs are consistent with cyber risk management objectives, and technology and cybersecurity policies integrate with an employee accountability policy to ensure that all personnel are held accountable for complying with policies."
    },
    {
        "id": "GV.PO-01.04",
        "description": "All personnel (employees and third party) consent to policies addressing acceptable technology use, social media use, personal device use (e.g., BYOD), confidentiality, and/or other security-related policies and agreements as warranted by their position."
    },
    {
        "id": "GV.PO-01.05",
        "description": "Technology and cybersecurity processes, procedures, and controls are established in alignment with cybersecurity policy."
    },
    {
        "id": "GV.PO-01.06",
        "description": "Physical and environmental security policies are implemented and managed."
    },
    {
        "id": "GV.PO-01.07",
        "description": "The organization maintains documented business continuity and resilience program policies and procedures approved by the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.PO-01.08",
        "description": "The organization maintains documented third-party risk management program policies and procedures approved by the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.PO-02.01",
        "description": "The cybersecurity policy is regularly reviewed, revised, and communicated under the leadership of a designated Cybersecurity Officer (e.g., CISO) to address changes in the risk profile and risk appetite, the evolving threat environment, and new technologies, products, services, and interdependencies."
    },
    {
        "id": "GV.OV-01.01",
        "description": "The governing authority (e.g., the Board or one of its committees) regularly reviews and evaluates the organization's ability to manage its technology, cybersecurity, third-party, and resilience risks."
    },
    {
        "id": "GV.OV-01.02",
        "description": "The designated Cybersecurity Officer (e.g., CISO) periodically reports to the appropriate governing authority (e.g., the Board or one of its committees) or equivalent governing body on the status of cybersecurity within the organization."
    },
    {
        "id": "GV.OV-01.03",
        "description": "The designated Technology Officer (e.g., CIO or CTO) regularly reports to the governing authority (e.g., the Board or one of its committees) on the status of technology use and risks within the organization."
    },
    {
        "id": "GV.OV-02.01",
        "description": "The organization regularly assesses its inherent technology and cybersecurity risks and ensures that changes to the business and threat environment lead to updates to the organization's strategies, programs, risk appetite and risk tolerance."
    },
    {
        "id": "GV.OV-02.02",
        "description": "The organization determines and articulates how it intends to maintain an acceptable level of residual technology and cybersecurity risk as set by the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.OV-03.01",
        "description": "The organization develops, implements, and reports to management and the governing body (e.g., the Board or one of its committees) key technology and cybersecurity risk and performance indicators and metrics to measure, monitor, and report actionable indicators."
    },
    {
        "id": "GV.OV-03.02",
        "description": "Resilience program performance is measured and regularly reported to senior executives and the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.SC-01.01",
        "description": "The organization maintains a third-party risk management strategy and program to identify and manage the risks associated with third parties throughout their lifecycles in a timely manner, including in support of sector-critical systems and operations, to ensure alignment within risk appetite."
    },
    {
        "id": "GV.SC-01.02",
        "description": "The organization regularly assesses the risk of its ongoing use of third parties in aggregate, considering factors such as critical service dependencies, vendor concentration, geographical/geopolitical exposure, fourth-party impacts, and financial sector co-dependencies."
    },
    {
        "id": "GV.SC-02.01",
        "description": "The organization clearly defines, and includes in contractual agreements, the division of cybersecurity and technology risk management responsibilities between the organization and its third parties (e.g., a Shared Responsibilities Model)."
    },
    {
        "id": "GV.SC-03.01",
        "description": "The organization's third-party risk management strategy and program aligns with and supports its enterprise, technology, cybersecurity, and resilience risk management frameworks and programs."
    },
    {
        "id": "GV.SC-04.01",
        "description": "The organization regularly identifies, inventories, and risk-ranks third-party relationships that are in place, and addresses any identified relationships that were established without formal approval."
    },
    {
        "id": "GV.SC-08.01",
        "description": "The organization's resilience strategy, plans, tests, and exercises incorporate its external dependencies and critical business partners."
    },
    {
        "id": "GV.SC-09.01",
        "description": "Consideration is specifically given to the implications of organizational third-party dependence, requirements, contracts, and interactions in the design, operation, monitoring, and improvement of policies, procedures, and controls to ensure the fulfillment of business requirements within risk appetite."
    },
    {
        "id": "GV.IR-01.01",
        "description": "The organization's enterprise-wide technology and cybersecurity risk management frameworks align with and support an independent risk management function that provides assurance that the frameworks are implemented consistently and as intended."
    },
    {
        "id": "GV.IR-01.02",
        "description": "The independent risk management function has sufficient independence, stature, authority, resources, and access to the governing body (e.g., the Board or one of its committees), including reporting lines, to ensure consistency with the organization's risk management frameworks."
    },
    {
        "id": "GV.IR-01.03",
        "description": "The independent risk management function has an understanding of the organization's structure, technology and cybersecurity strategies and programs, and relevant risks and threats."
    },
    {
        "id": "GV.IR-02.01",
        "description": "The independent risk management function regularly evaluates the appropriateness of the technology and cybersecurity risk management programs to the organization's risk appetite and inherent risk environment"
    },
    {
        "id": "GV.IR-02.02",
        "description": "The independent risk management function regularly assesses the organization's controls and cybersecurity risk exposure, identifies opportunities for improvement based on assessment results, and recommends program improvements"
    },
    {
        "id": "GV.IR-03.01",
        "description": "The independent risk management function reports to the governing authority (e.g., the Board or one of its committees) and to the designated risk management officer within the organization on the implementation of the technology and cybersecurity risk management frameworks throughout the organization and its independent assessment of risk posture."
    },
    {
        "id": "GV.AU-01.01",
        "description": "The organization has an independent audit function (i.e., internal audit group or external auditor) that follows generally accepted audit practices and approved audit policies and procedures."
    },
    {
        "id": "GV.AU-01.02",
        "description": "The organization has an independent audit plan that provides for the evaluation of technology and cybersecurity risk, including compliance with the approved risk management framework, policies, and processes for technology, cybersecurity, and resilience; and how well the organization adapts to the evolving risk environment while remaining within its stated risk appetite and tolerance."
    },
    {
        "id": "GV.AU-01.03",
        "description": "The independent audit function tests technology management, cybersecurity, incident response, and resilience policies and controls."
    },
    {
        "id": "GV.AU-01.04",
        "description": "The independent audit function evaluates and tests third-party risk management policies and controls, identifies weaknesses and gaps, and recommends improvements to senior management and the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "GV.AU-01.05",
        "description": "An independent audit function assesses compliance with applicable laws and regulations."
    },
    {
        "id": "GV.AU-02.01",
        "description": "A formal process is in place for the independent audit function to review and update its procedures and audit plans regularly or in response to changes in relevant standards, the technology environment, or the business environment."
    },
    {
        "id": "GV.AU-02.02",
        "description": "A formal process is in place for the independent audit function to update its procedures and audit plans based on changes to the organization's risk appetite, risk tolerance, threat environment, and evolving risk profile."
    },
    {
        "id": "GV.AU-03.01",
        "description": "The independent audit function reviews technology and cybersecurity practices and identifies weaknesses and gaps."
    },
    {
        "id": "GV.AU-03.02",
        "description": "The independent audit function tracks identified issues and corrective actions from internal audits and independent testing/assessments to ensure timely resolution."
    },
    {
        "id": "GV.AU-03.03",
        "description": "The independent audit function reports to the governing authority (e.g., the Board or one of its committees) within the organization, including when its assessment differs from that of the organization, or when risk tolerance has been exceeded in any part of the organization."
    },
    {
        "id": "ID.AM-01.01",
        "description": "The organization maintains a current and complete asset inventory of physical devices, hardware, and information systems."
    },
    {
        "id": "ID.AM-02.01",
        "description": "The organization maintains a current and complete inventory of software platforms, business applications, and other software assets (e.g., virtual machines and virtual network devices)."
    },
    {
        "id": "ID.AM-03.01",
        "description": "The organization maintains current maps of network resources, mobile resources, external connections, network-connected third parties, and network data flows."
    },
    {
        "id": "ID.AM-04.01",
        "description": "Hardware, software, and data assets maintained by or located at suppliers or other third parties are included in asset management inventories and lifecycle management processes as required for effective management and security."
    },
    {
        "id": "ID.AM-05.01",
        "description": "The organization establishes and maintains risk-based policies and procedures for the classification of hardware, software, and data assets based on sensitivity and criticality."
    },
    {
        "id": "ID.AM-05.02",
        "description": "The organization's hardware, software, and data assets are prioritized for protection based on their sensitivity, criticality, vulnerability, business value, and dependency role in the delivery of critical services."
    },
    {
        "id": "ID.AM-07.01",
        "description": "The organization maintains a current inventory of the data being created, stored, or processed by its information assets and data flow diagrams depicting key internal and external data flows."
    },
    {
        "id": "ID.AM-08.01",
        "description": "The organization establishes and maintains asset lifecycle management policies and procedures to ensure that assets are acquired, tracked, implemented, used, decommissioned, and protected commensurate with their sensitivity, criticality, and business value."
    },
    {
        "id": "ID.AM-08.02",
        "description": "The organization establishes policies, and employs methods to identify, assess, and manage technology solutions that are acquired, managed, or used outside of established, governed technology and cybersecurity processes (i.e., \"Shadow IT\")."
    },
    {
        "id": "ID.AM-08.03",
        "description": "The organization establishes policies, standards, and procedures for data governance, data management, and data retention consistent with its legal obligations and the value of data as an organizational asset."
    },
    {
        "id": "ID.AM-08.04",
        "description": "The organization's asset management processes ensure the protection of sensitive data throughout removal, transfers, maintenance, end-of-life, and secure disposal or re-use."
    },
    {
        "id": "ID.AM-08.05",
        "description": "The organization defines and implements standards and procedures, consistent with its data retention policy, for destroying or securely erasing data, media, and storage devices when the data is no longer needed."
    },
    {
        "id": "ID.AM-08.06",
        "description": "Minimum cybersecurity requirements for third-parties cover the entire relationship lifecycle, from the acquisition of data through the return or destruction of data, to include limitations on data use, access, storage, and geographic location."
    },
    {
        "id": "ID.RA-01.01",
        "description": "The organization identifies, assesses, and documents risks and potential vulnerabilities associated with assets, to include workforce, data, technology, facilities, services, and connections."
    },
    {
        "id": "ID.RA-01.02",
        "description": "The organization's business units ensure that information regarding cyber risk is shared with the appropriate level of senior management in a timely manner, so that they can address and respond to emerging cyber risk."
    },
    {
        "id": "ID.RA-01.03",
        "description": "The organization establishes and maintains standards and capabilities for ongoing vulnerability management, including systematic scans, or reviews reasonably designed to identify known cyber vulnerabilities and upgrade opportunities, across the organization's environments and assets."
    },
    {
        "id": "ID.RA-02.01",
        "description": "The organization participates actively (in alignment with its business operations, inherent risk, and complexity) in information-sharing groups and collectives (e.g., cross-industry, cross-government and cross-border groups) to gather, distribute and analyze information about cyber practices, cyber threats, and early warning indicators relating to cyber threats."
    },
    {
        "id": "ID.RA-02.02",
        "description": "The organization shares authorized information on its cyber resilience framework and the effectiveness of protection technologies bilaterally with trusted external stakeholders to promote the understanding of each party’s approach to securing systems."
    },
    {
        "id": "ID.RA-03.01",
        "description": "The organization, on an ongoing basis, identifies, analyzes, correlates, characterizes, and reports threats that are internal and external to the firm."
    },
    {
        "id": "ID.RA-03.02",
        "description": "The organization solicits and considers threat intelligence received from the organization's stakeholders, service and utility providers, and other industry and security organizations."
    },
    {
        "id": "ID.RA-03.03",
        "description": "The organization includes in its threat analysis those cyber threats which could trigger extreme but plausible cyber events, even if they are considered unlikely to occur or have never occurred in the past."
    },
    {
        "id": "ID.RA-03.04",
        "description": "The organization regularly reviews and updates its threat analysis methodology, threat information sources, and supporting tools."
    },
    {
        "id": "ID.RA-04.01",
        "description": "The organization's risk assessment approach includes the analysis and characterization of the likelihood and potential business impact of identified risks being realized."
    },
    {
        "id": "ID.RA-05.01",
        "description": "Threats, vulnerabilities, likelihoods, and impacts are used to determine overall technology, cybersecurity, and resilience risk to the organization."
    },
    {
        "id": "ID.RA-05.02",
        "description": "The organization has established threat modeling capabilities to identify how and why critical assets might be compromised by a threat actor, what level of protection is needed for those critical assets, and what the impact would be if that protection failed."
    },
    {
        "id": "ID.RA-05.03",
        "description": "The organization's business units assess, on an ongoing basis, the technology, cybersecurity, and resilience risks associated with the activities of the business unit."
    },
    {
        "id": "ID.RA-05.04",
        "description": "The organization uses scenario planning, table-top-exercises, or similar event analysis techniques to identify vulnerabilities and determine potential impacts to critical infrastructure, technology, and business processes."
    },
    {
        "id": "ID.RA-06.01",
        "description": "Technology and cybersecurity risk management programs and risk assessment processes produce actionable recommendations that the organization uses to select, design, prioritize, implement, maintain, evaluate, and modify cybersecurity and technology controls."
    },
    {
        "id": "ID.RA-06.02",
        "description": "The implementation of responses to address identified risks (i.e., risk avoidance, risk mitigation, risk acceptance, or risk transfer (e.g., cyber insurance)) are formulated, assessed, documented, and prioritized based on criticality to the business."
    },
    {
        "id": "ID.RA-06.03",
        "description": "Technology and cybersecurity programs identify and implement controls to manage applicable risks within the risk appetite set by the governing authority (e.g., the Board or one of its committees)."
    },
    {
        "id": "ID.RA-06.04",
        "description": "The organization assesses the threats, impacts, and risks that could adversely affect the organization's ability to provide services on an ongoing basis, and develops its resilience requirements and plans to address those risks."
    },
    {
        "id": "ID.RA-06.05",
        "description": "The organization defines and implements standards and procedures to prioritize and remediate issues identified in vulnerability scanning or penetration testing, including emergency or zero-day threats and vulnerabilities."
    },
    {
        "id": "ID.RA-06.06",
        "description": "The organization follows documented procedures, consistent with established risk response processes, for mitigating or accepting the risk of vulnerabilities or weaknesses identified in exercises and testing or when responding to incidents."
    },
    {
        "id": "ID.RA-07.01",
        "description": "The organization defines and implements change management standards and procedures, to include emergency change procedures, that explicitly address risk identified both prior to and during a change, any new risk created post-change, as well as the reviewing and approving authorities (e.g., change advisory boards)."
    },
    {
        "id": "ID.RA-07.02",
        "description": "Risk-based criteria are used to categorize each system change, to include emergency changes, to determine the necessary change process standards to apply for change planning, rollback planning, pre-change testing, change access control, post-change verification, and change review and approval."
    },
    {
        "id": "ID.RA-07.03",
        "description": "Technology projects and system change processes ensure that requisite changes in security posture, data classification and flows, architecture, support documentation, business processes, and business resilience plans are addressed."
    },
    {
        "id": "ID.RA-07.04",
        "description": "Policy exceptions, risk mitigation plans, and risk acceptances resulting from assessments and evaluations, such as testing, exercises, audits, etc., are formally managed, approved, escalated to defined levels of management, and tracked to closure."
    },
    {
        "id": "ID.RA-07.05",
        "description": "The organization establishes and maintains an exception management process for identified vulnerabilities that cannot be mitigated within target timeframes."
    },
    {
        "id": "ID.RA-08.01",
        "description": "The organization has established enterprise processes for soliciting, receiving and appropriately channeling vulnerability disclosures from"
    },
    {
        "id": "ID.RA-08.02",
        "description": "The organization has established enterprise processes to analyze disclosed vulnerabilities with a focus on"
    },
    {
        "id": "ID.IM-01.01",
        "description": "Technology, cybersecurity, and resilience controls are regularly assessed and/or tested for design and operating effectiveness."
    },
    {
        "id": "ID.IM-01.02",
        "description": "The organization implements a regular process to collect, store, report, benchmark, and assess trends in actionable performance indicators and risk metrics (e.g., threat KRIs, security incident metrics, vulnerability metrics, and operational measures)."
    },
    {
        "id": "ID.IM-01.03",
        "description": "The organization establishes specific objectives, performance criteria, benchmarks, and tolerance limits to identify areas that have improved or are in need of improvement over time."
    },
    {
        "id": "ID.IM-01.04",
        "description": "Technology and cybersecurity programs include elements designed to assess, manage, and continually improve the quality of program delivery in addressing stakeholder requirements and risk reduction."
    },
    {
        "id": "ID.IM-01.05",
        "description": "The organization's third-party risk management program is regularly assessed, reported on, and improved."
    },
    {
        "id": "ID.IM-02.01",
        "description": "The organization conducts regular, independent penetration testing and red team testing on the organization's network, internet-facing systems, critical applications, and associated controls to identify gaps in cybersecurity defenses."
    },
    {
        "id": "ID.IM-02.02",
        "description": "The thoroughness and results of independent penetration testing are regularly reviewed to help determine the need to rotate testing vendors to obtain fresh independent perspectives."
    },
    {
        "id": "ID.IM-02.03",
        "description": "The organization tests and validates the effectiveness of the incident detection, reporting, and communication processes and protocols with internal and external stakeholders."
    },
    {
        "id": "ID.IM-02.04",
        "description": "The organization's testing program validates the effectiveness of its resilience strategy and response, disaster recovery, and resumption plans on a regular basis or upon major changes to business or system functions, and includes external stakeholders as required."
    },
    {
        "id": "ID.IM-02.05",
        "description": "The organization establishes testing programs that include a range of scenarios, including severe but plausible scenarios (e.g., disruptive, destructive, corruptive), that could affect the organization's ability to service internal and external stakeholders."
    },
    {
        "id": "ID.IM-02.06",
        "description": "The organization designs and tests its systems and processes, and employs third-party support resources (e.g., Sheltered Harbor), to enable recovery of accurate data (e.g., material financial transactions) sufficient to support defined business recovery time and recovery point objectives."
    },
    {
        "id": "ID.IM-02.07",
        "description": "The organization's governing body (e.g., the Board or one of its committees) and senior management are involved in testing as part of a crisis management team and are informed of test results."
    },
    {
        "id": "ID.IM-02.08",
        "description": "The organization tests and exercises, independently and in coordination with other critical sector partners, its ability to support sector-wide resilience in the event of extreme financial stress or the instability of external dependencies, such as connectivity to markets, payment systems, clearing entities, messaging services, etc."
    },
    {
        "id": "ID.IM-02.09",
        "description": "Corrective actions for gaps identified during security-related, incident management, response plan, and disaster recovery testing are retested and validated, or have a formal risk acceptance or risk exception."
    },
    {
        "id": "ID.IM-03.01",
        "description": "A formal process is in place to improve protection controls and processes by integrating recommendations, findings, and lessons learned from exercises, testing, audits, assessments, and incidents."
    },
    {
        "id": "ID.IM-03.02",
        "description": "The organization establishes a systematic and comprehensive program to regularly evaluate and improve its monitoring and detection processes and controls as the threat environment changes, tools and techniques evolve, and lessons are learned."
    },
    {
        "id": "ID.IM-04.01",
        "description": "The organization's business continuity, disaster recovery, crisis management, and response plans are in place and managed, aligned with each other, and incorporate considerations of cyber incidents."
    },
    {
        "id": "ID.IM-04.02",
        "description": "The organization's incident response and business continuity plans contain clearly defined roles, responsibilities, and levels of decision-making authority, and include all needed areas of participation and expertise across the organization and key third-parties."
    },
    {
        "id": "ID.IM-04.03",
        "description": "Recovery plans include service resumption steps for all operating environments, including traditional, alternate recovery, and highly available (e.g., cloud) infrastructures."
    },
    {
        "id": "ID.IM-04.04",
        "description": "The organization has plans to identify, in a timely manner, the status of all transactions and member positions at the time of a disruption, supported by corresponding recovery point objectives."
    },
    {
        "id": "ID.IM-04.05",
        "description": "Recovery plans include restoration of resilience following a long term loss of capability (e.g., at an alternate site or a third-party), detailing when the plan should be activated and implementation steps."
    },
    {
        "id": "ID.IM-04.06",
        "description": "The organization has established and implemented plans to identify and mitigate the cyber risks it poses through interconnectedness to sector partners and external stakeholders."
    },
    {
        "id": "ID.IM-04.07",
        "description": "The organization pre-identifies, pre-qualifies, and retains third party incident management support and forensic service firms, as required, that can be called upon to quickly assist with incident response, investigation, and recovery."
    },
    {
        "id": "ID.IM-04.08",
        "description": "The organization regularly reviews response strategy, incident management plans, recovery plans, and associated tests and exercises and updates them, as necessary, based on"
    },
    {
        "id": "PR.AA-01.01",
        "description": "Identities and credentials are actively managed or automated for authorized devices and users (e.g., removal of default and factory passwords, password strength requirements, automatic revocation of credentials under defined conditions, regular asset owner access review, etc.)."
    },
    {
        "id": "PR.AA-01.02",
        "description": "Physical and logical access to systems is permitted only for individuals who have a legitimate business requirement, have been authorized, and who are adequately trained and monitored."
    },
    {
        "id": "PR.AA-02.01",
        "description": "The organization authenticates identity, validates the authorization level of a user before granting access to its systems, limits the use of an account to a single individual, and attributes activities to the user in logs and transactions."
    },
    {
        "id": "PR.AA-03.01",
        "description": "Based on the risk level of a user access or a specific transaction, the organization defines and implements authentication requirements, which may include multi-factor or out-of-band authentication, and may adopt other real-time risk prevention or mitigation tactics."
    },
    {
        "id": "PR.AA-03.02",
        "description": "Decisions to authorize user access to devices and other assets are made with consideration of"
    },
    {
        "id": "PR.AA-03.03",
        "description": "The organization reduces fraudulent activity and protects reputational integrity through email verification mechanisms (e.g., DMARC, DKIM), call-back verification, secure file exchange facilities, out-of-band communications, customer outreach and education, and other tactics designed to thwart imposters and fraudsters."
    },
    {
        "id": "PR.AA-04.01",
        "description": "Access credential and authorization mechanisms for internal systems and across security perimeters (e.g., leveraging directory services, directory synchronization, single sign-on, federated access, credential mapping, etc.) are designed to maintain security, integrity, and authenticity."
    },
    {
        "id": "PR.AA-05.01",
        "description": "The organization limits access privileges to the minimum necessary and with consideration of separation of duties (e.g., through role-based access control, asset owner access recertifications, etc.)."
    },
    {
        "id": "PR.AA-05.02",
        "description": "The organization institutes controls over privileged system access by strictly limiting and closely managing staff and services with elevated system entitlements (e.g., multi-factor authentication, dual accounts, privilege and time constraints, etc.)"
    },
    {
        "id": "PR.AA-05.03",
        "description": "The organization institutes controls over service account (i.e., accounts used by systems to access other systems) lifecycles to ensure strict security over creation, use, and termination; access credentials (e.g., no embedded passwords in code); frequent reviews of account ownership; visibility for unauthorized use; and hardening against malicious insider use."
    },
    {
        "id": "PR.AA-05.04",
        "description": "Specific roles, responsibilities, and procedures to manage the risk of third-party access to organizational systems and facilities are defined and implemented."
    },
    {
        "id": "PR.AA-06.01",
        "description": "The organization manages, protects, and logs physical access to sensitive areas, devices, consoles, equipment, and network cabling and infrastructure."
    },
    {
        "id": "PR.AA-06.02",
        "description": "The organization manages and protects physical and visual access to sensitive information assets and physical records (e.g., session lockout, clean desk policies, printer/facsimile output trays, file cabinet/room security, document labelling, etc.)"
    },
    {
        "id": "PR.AT-01.01",
        "description": "All personnel receive cybersecurity awareness training upon hire and on a regular basis."
    },
    {
        "id": "PR.AT-01.02",
        "description": "Cybersecurity awareness training includes, at a minimum, awareness of and competencies for data protection, personal data handling, compliance obligations, working with third parties, detecting cyber risks, and how to report any unusual activity or incidents."
    },
    {
        "id": "PR.AT-01.03",
        "description": "Cybersecurity awareness training is updated on a regular basis to reflect risks and threats identified by the organization, the organization's security policies and standards, applicable laws and regulations, and changes in individual responsibilities."
    },
    {
        "id": "PR.AT-01.04",
        "description": "As new technology is deployed or undergoes change that also requires changes in practices, all impacted personnel (e.g., end-users, developers, operators, etc.) are trained on the new system and any accompanying technology and cybersecurity risks."
    },
    {
        "id": "PR.AT-02.01",
        "description": "Mechanisms are in place to ensure that the personnel working with cybersecurity and technology (e.g., developers, DBAs, network admins, etc.) maintain current knowledge and skills related to changing threats, countermeasures, new tools, best practices, and their job responsibilities."
    },
    {
        "id": "PR.AT-02.02",
        "description": "High-risk groups, such as those with elevated privileges or in sensitive business functions (including privileged users, senior executives, cybersecurity personnel and third-party stakeholders), receive cybersecurity situational awareness training for their roles and responsibilities."
    },
    {
        "id": "PR.AT-02.03",
        "description": "All personnel (employee and third party) are made aware of and are trained for their role and operational steps in response and recovery plans."
    },
    {
        "id": "PR.AT-02.04",
        "description": "The organization maintains and enhances the skills and knowledge of the in-house staff performing incident management and forensic investigation activities."
    },
    {
        "id": "PR.AT-02.05",
        "description": "All third party staff receive cybersecurity awareness and job training sufficient for them to perform their duties and maintain organizational security."
    },
    {
        "id": "PR.AT-02.06",
        "description": "The organization has established and maintains a cybersecurity awareness program through which the organization's customers are kept aware of new threats and vulnerabilities, basic cybersecurity hygiene practices, and their role in cybersecurity, as appropriate."
    },
    {
        "id": "PR.AT-02.07",
        "description": "The organization's governing body (e.g., the Board or one of its committees) and senior management receive cybersecurity situational awareness training to include appropriate skills and knowledge to"
    },
    {
        "id": "PR.AT-02.08",
        "description": "Where the organization's governing authority (e.g., the Board or one of its committees) does not have adequate cybersecurity expertise, they should have direct access to the senior officer responsible for cybersecurity and independent sources of expertise to discuss cybersecurity related matters."
    },
    {
        "id": "PR.DS-01.01",
        "description": "Data-at-rest is protected commensurate with the criticality and sensitivity of the information and in alignment with the data classification and protection policy (e.g., through the use of encryption, authentication, access control, segregation, masking, tokenization, and file integrity monitoring)."
    },
    {
        "id": "PR.DS-01.02",
        "description": "The organization implements data loss identification and prevention tools to monitor and protect against confidential data theft or destruction by an employee or an external actor."
    },
    {
        "id": "PR.DS-01.03",
        "description": "The organization defines and implements controls for the protection and use of removable media (e.g., access/use restrictions, encryption, malware scanning, data loss prevention, etc.)"
    },
    {
        "id": "PR.DS-02.01",
        "description": "Data-in-transit is protected commensurate with the criticality and sensitivity of the information and in alignment with the data classification and protection policy (e.g., through the use of encryption, authentication, access control, masking, tokenization, and alternate transit paths)."
    },
    {
        "id": "PR.DS-10.01",
        "description": "Data-in-use is protected commensurate with the criticality and sensitivity of the information and in alignment with the data classification and protection policy (e.g., through the use of encryption, authentication, access control, masking, tokenization, visual shielding, memory integrity monitoring, etc.)"
    },
    {
        "id": "PR.DS-11.01",
        "description": "The organization defines and implements standards and procedures for configuring and performing backups and data replications, including defining backup requirements by data/application/infrastructure criticality, segregating (e.g., air-gapping) and securing backups, verifying backup integrity, and performing backup restoration testing."
    },
    {
        "id": "PR.PS-01.01",
        "description": "The organization establishes and maintains standard system security configuration baselines, informed by industry standards and hardening guidelines, to facilitate the consistent application of security settings, configurations, and versions."
    },
    {
        "id": "PR.PS-01.02",
        "description": "The organization's systems are configured to provide only essential capabilities to implement the principle of least functionality."
    },
    {
        "id": "PR.PS-01.03",
        "description": "The organization employs detection measures and performs regular enforcement checks to ensure that non-compliance with baseline security standards is promptly identified and rectified."
    },
    {
        "id": "PR.PS-01.04",
        "description": "The organization documents its requirements for accurate and resilient time services (e.g., synchronization to a mandated or appropriate authoritative time source) and adopts best practice guidance in implementing and using these services for logging, event correlation, forensic analysis, authentication, transactional processing, and other purposes."
    },
    {
        "id": "PR.PS-01.05",
        "description": "Acceptable encryption standards, methods, and management practices are established in accordance with defined industry standards."
    },
    {
        "id": "PR.PS-01.06",
        "description": "The organization employs defined encryption methods and management practices commensurate with the criticality of the information being protected and the inherent risk of the technical environment where used."
    },
    {
        "id": "PR.PS-01.07",
        "description": "Cryptographic keys and certificates are tracked, managed, and protected throughout their lifecycles, to include for compromise and revocation."
    },
    {
        "id": "PR.PS-01.08",
        "description": "End-user mobile or personal computing devices accessing the organization's network employ mechanisms to protect network, application, and data integrity, such as \"Mobile Device Management (MDM)\" and \"Mobile Application Management (MAM)\" technologies, device fingerprinting, storage containerization and encryption, integrity scanning, automated patch application, remote wipe, and data leakage protections."
    },
    {
        "id": "PR.PS-01.09",
        "description": "Endpoint systems implemented using virtualization technologies employ mechanisms to protect network, application, and data integrity, such as restricting access to local network and peripheral devices, multi-factor authentication, locking-down device source network locations, and data leakage protections."
    },
    {
        "id": "PR.PS-02.01",
        "description": "The organization defines and implements controls to identify patches to technology assets, assess patch criticality and risk, test patches, and apply patches within risk/criticality-based target time frames."
    },
    {
        "id": "PR.PS-02.02",
        "description": "The organization establishes standards and practices for ongoing application management to ensure that applications remain secure and continue to meet organizational needs."
    },
    {
        "id": "PR.PS-02.03",
        "description": "Technology obsolescence, unsupported systems, and end-of-life decommissioning/replacements are addressed in a risk-based manner and actively planned for, funded, managed, and securely executed."
    },
    {
        "id": "PR.PS-03.01",
        "description": "The organization defines and implements controls for the on-site and remote maintenance and repair of the organization's technology assets (e.g., work must be performed by authorized personnel, use of approved procedures and tools, use of original or vendor-approved spare parts)."
    },
    {
        "id": "PR.PS-04.01",
        "description": "The organization establishes and regularly reviews log management standards and practices, to include the types of events to be detected, log content, security and access considerations, monitoring protocols, integrity checking mechanisms, and retention periods."
    },
    {
        "id": "PR.PS-04.02",
        "description": "The organization defines the scope and coverage of audit/log records to be created and monitored (i.e., internal and external environments, devices, and applications/services/software to be monitored) and has controls in place to ensure that the intended scope is fully covered and that no logging failures are inhibiting the collection of required logs."
    },
    {
        "id": "PR.PS-04.03",
        "description": "The organization's activity logs and other security event logs are generated, reviewed, securely stored, and retained in accordance with data retention obligations and established standards."
    },
    {
        "id": "PR.PS-05.01",
        "description": "The organization has policies, procedures, and tools in place to detect and block malware from infecting networks and systems, including automatically updating malware signatures and behavior profiles on all endpoints."
    },
    {
        "id": "PR.PS-05.02",
        "description": "The organization implements safeguards against unauthorized mobile code (e.g., JavaScript, ActiveX, VBScript, PowerShell, etc.) on mobile, end point, and server systems."
    },
    {
        "id": "PR.PS-05.03",
        "description": "The organization has policies, procedures, and tools in place to detect, isolate, and block the use of attached malware or malicious links present in email or message services."
    },
    {
        "id": "PR.PS-06.01",
        "description": "The organization implements Secure Systems Development Lifecycle processes for in-house software design, configuration, and development, employing best practices from secure-by-design methodologies (e.g., secure coding, code review, application security testing, etc.) during all phases of both traditional and agile projects."
    },
    {
        "id": "PR.PS-06.02",
        "description": "The architecture, design, coding, testing, and operationalization of system solutions address the unique security, resilience, technical, and operational characteristics of the target platform environment(s) (e.g., distributed system, mainframe, cloud, API, mobile, database, etc.)"
    },
    {
        "id": "PR.PS-06.03",
        "description": "Functional, operational, resilience, and security requirements for system development and implementation projects are documented, agreed to by relevant stakeholders, and tracked and managed through development, testing, assurance, acceptance, and delivery."
    },
    {
        "id": "PR.PS-06.04",
        "description": "Systems development and testing tools, processes, and environments employ security mechanisms to protect and improve the integrity and confidentiality of both the SDLC process and the resulting product (e.g., secured code repositories, segmented environments, automated builds, etc.)"
    },
    {
        "id": "PR.PS-06.05",
        "description": "A software security testing and validation strategy is developed and implemented in the development lifecycle of all software projects, defining testing requirements and plans; performing/automating testing, vulnerability scanning, and migration activities; and supporting code integrity verification (e.g., using digital signatures)."
    },
    {
        "id": "PR.PS-06.06",
        "description": "The system development lifecycle remediates known critical vulnerabilities, and critical vulnerabilities discovered during testing, prior to production deployment."
    },
    {
        "id": "PR.PS-06.07",
        "description": "DevOps/DevSecOps practices and procedures are aligned with Systems Development Lifecycle, security operations, and technology service management processes."
    },
    {
        "id": "PR.PS-06.08",
        "description": "The design, configuration, security control, and operation of key applications and system services are documented sufficiently to support ongoing management, operation, change, and assessment."
    },
    {
        "id": "PR.PS-06.09",
        "description": "End-user developed solutions, to include models used to support critical business processes and decisions, are formally identified and managed in alignment with their criticality and risk."
    },
    {
        "id": "PR.PS-06.10",
        "description": "The organization establishes policies and procedures for the secure design, configuration, modification, and operation of databases, data stores, and data analytics platforms consistent with the criticality of the data being managed."
    },
    {
        "id": "PR.PS-07.01",
        "description": "The organization's technology operations, process verification, error detection, issue management, root cause analysis, and problem management functions are formally documented, monitored, and KPIs are regularly reported to stakeholders."
    },
    {
        "id": "PR.PS-07.02",
        "description": "Technology service and support functions address stakeholder expectations (e.g., through stated requirements, SLAs, or OLAs) and performance is monitored and regularly reported to stakeholders."
    },
    {
        "id": "PR.IR-01.01",
        "description": "Networks, systems, and external connections are segmented (e.g., using firewalls, software-defined networks, guest wireless networks, etc.) to implement defense-in-depth and access isolation principles."
    },
    {
        "id": "PR.IR-01.02",
        "description": "Network device configurations (e.g., firewall rules, ports, and protocols) are documented, reviewed and updated regularly and upon change to ensure alignment with network access, segmentation, traversal, and deny-all default requirements."
    },
    {
        "id": "PR.IR-01.03",
        "description": "The integrity and resilience of the organization's communications and control network services are enhanced through controls such as denial of service protections, secure name/address resolution, and/or alternate communications paths."
    },
    {
        "id": "PR.IR-01.04",
        "description": "The organization controls access to its wireless networks and the information that these networks process by implementing appropriate mechanisms (e.g., strong authentication for authentication and transmission, preventing unauthorized devices from connecting to the internal networks, restricting unauthorized traffic, and segregating guest wireless networks)."
    },
    {
        "id": "PR.IR-01.05",
        "description": "Remote access is carefully controlled (e.g., restricted to defined systems, access is actively managed (e.g., session timeouts, logging, forced disconnect, etc.), and encrypted connections with multi-factor authentication are used)."
    },
    {
        "id": "PR.IR-01.06",
        "description": "The organization's production and non-production environments and data are segregated and managed to prevent unauthorized access or changes to the information assets."
    },
    {
        "id": "PR.IR-01.07",
        "description": "The organization defines and implements controls for securely configuring and operating Operational Technologies, Industrial Control Systems, and Internet-of-Things (IoT) devices (e.g., segregated printer networks, resetting of default passwords, etc.)"
    },
    {
        "id": "PR.IR-01.08",
        "description": "The organization implements policies, procedures, end-user agreements, and technical controls to address the risks of end-user mobile or personal computing devices accessing the organization's network and resources."
    },
    {
        "id": "PR.IR-02.01",
        "description": "The organization designs, documents, implements, tests, and maintains environmental and physical controls to meet defined business resilience requirements (e.g., environmental monitoring, dual power and communication sources, regionally separated backup processing facilities, etc.)"
    },
    {
        "id": "PR.IR-03.01",
        "description": "The organization implements mechanisms (e.g., failsafe, load balancing, hot swaps, redundant equipment, alternate services, backup facilities, etc.) to achieve resilience requirements in normal and adverse situations."
    },
    {
        "id": "PR.IR-04.01",
        "description": "Baseline measures of network and system utilization and transaction activity are captured to support capacity planning and anomalous activity detection."
    },
    {
        "id": "PR.IR-04.02",
        "description": "Technology availability and capacity is planned, monitored, managed, and optimized to meet business resilience objectives and reasonably anticipated infrastructure demands."
    },
    {
        "id": "DE.CM-01.01",
        "description": "The organization deploys intrusion detection and intrusion prevention capabilities to detect and prevent a potential network intrusion in its early stages for timely containment and recovery."
    },
    {
        "id": "DE.CM-01.02",
        "description": "The organization implements mechanisms, such as alerting and filtering of sudden high volumes and suspicious incoming traffic, to detect and mitigate Denial of Service, \"bot\", and credential stuffing attacks."
    },
    {
        "id": "DE.CM-01.03",
        "description": "The organization has policies, procedures, and tools in place to monitor for, detect, and block unauthorized network connections and data transfers."
    },
    {
        "id": "DE.CM-01.04",
        "description": "The organization has policies, procedures, and tools in place to monitor for, detect, and block access from/to devices that are not authorized or do not conform to security policy (e.g., unpatched systems)."
    },
    {
        "id": "DE.CM-01.05",
        "description": "The organization implements measures to detect and block access to unauthorized, inappropriate, or malicious websites and services (e.g. social media, messaging, file sharing)."
    },
    {
        "id": "DE.CM-01.06",
        "description": "The organization employs deception techniques and technologies (e.g., honeypots) to detect and prevent a potential intrusion in its early stages to support timely containment and recovery."
    },
    {
        "id": "DE.CM-02.01",
        "description": "The organization's controls include monitoring and detection of anomalous activities and potential intrusion events across the organization's physical environment and infrastructure, including the detection of environmental threats (fire, water, service outages, etc.) and unauthorized physical access to high-risk system components and locations."
    },
    {
        "id": "DE.CM-03.01",
        "description": "Account access, authentication, and authorization activities are logged and monitored, for both users and devices, to enforce authorized access."
    },
    {
        "id": "DE.CM-03.02",
        "description": "The organization's controls actively monitor personnel (both authorized and unauthorized) for access, authentication, usage, connections, devices, and anomalous behavior to rapidly detect potential cybersecurity events."
    },
    {
        "id": "DE.CM-03.03",
        "description": "The organization logs and reviews the activities of privileged users and accounts, and monitoring for anomalous behaviors is implemented."
    },
    {
        "id": "DE.CM-06.01",
        "description": "The organization reviews, documents, authorizes, and monitors all third-party connections, data transfer mechanisms, and Application Programming Interfaces (APIs)."
    },
    {
        "id": "DE.CM-06.02",
        "description": "The organization implements an explicit approval and logging process and sets up automated alerts to monitor and prevent any unauthorized access to a critical system by a third-party service provider."
    },
    {
        "id": "DE.CM-09.01",
        "description": "The organization uses integrity checking mechanisms to verify software, firmware and information integrity and provenance (e.g., checksums, Software Bill of Materials, etc.)"
    },
    {
        "id": "DE.CM-09.02",
        "description": "The organization uses integrity checking mechanisms to verify hardware integrity."
    },
    {
        "id": "DE.CM-09.03",
        "description": "The organization has policies, procedures, and tools in place to monitor for, detect, and block the use of unsupported or unauthorized software, hardware, or configuration changes."
    },
    {
        "id": "DE.AE-02.01",
        "description": "The organization performs timely collection of event data, as well as advanced and automated analysis (including the use of security tools such as antivirus and IDS/IPS) on the detected events to"
    },
    {
        "id": "DE.AE-02.02",
        "description": "The organization establishes, documents, and regularly reviews event alert parameters and thresholds, as well as rule-based triggers to support automated responses, when known attack patterns, signatures or behaviors are detected."
    },
    {
        "id": "DE.AE-03.01",
        "description": "The organization implements systematic and real-time logging, collection, monitoring, detection, and alerting measures across multiple layers of the organization's infrastructure, including physical perimeters, network, operating systems, applications, data, and external (cloud and outsourced) environments, sufficient to protect the organization's information assets."
    },
    {
        "id": "DE.AE-03.02",
        "description": "The organization performs real-time central analysis, aggregation, and correlation of anomalous activities, network and system alerts, and relevant event and cyber threat intelligence, including both internal and external (cloud and outsourced) environments, to better detect and prevent multifaceted cyber attacks."
    },
    {
        "id": "DE.AE-04.01",
        "description": "The organization has a documented process to analyze and triage incidents to assess root cause, technical impact, mitigation priority, and business impact on the organization, as well as across the financial sector and other third party stakeholders."
    },
    {
        "id": "DE.AE-06.01",
        "description": "The organization has established processes and protocols to communicate, alert, and regularly report potential cyber attacks and incident information, including its corresponding analysis and cyber threat intelligence, to authorized internal and external stakeholders."
    },
    {
        "id": "DE.AE-07.01",
        "description": "The organization implements measures for monitoring external sources (e.g., social media, the dark web, etc.) to integrate with other intelligence information to better detect and evaluate potential threats and compromises."
    },
    {
        "id": "DE.AE-07.02",
        "description": "Relevant event data is packaged for subsequent review and triage and events are categorized for efficient handling, assignment, and escalation."
    },
    {
        "id": "DE.AE-08.01",
        "description": "Defined criteria and severity levels are in place to facilitate the declaration, escalation, organization, and alignment of response activities to response plans within the organization and across relevant third parties."
    },
    {
        "id": "RS.MA-01.01",
        "description": "The organization's response plans are in place and executed during or after an incident, to include coordination with relevant third parties and engagement of third-party incident support services."
    },
    {
        "id": "RS.MA-02.01",
        "description": "Tools and processes are in place to ensure timely detection, inspection, assessment, and analysis of security event data for reliable activation of incident response processes."
    },
    {
        "id": "RS.MA-03.01",
        "description": "The organization categorizes and prioritizes cybersecurity incident response consistent with response plans and criticality of systems and services to the enterprise."
    },
    {
        "id": "RS.MA-04.01",
        "description": "Response activities are centrally coordinated, response progress and milestones are tracked and documented, and new incident information is assimilated into ongoing tasks, assignments, and escalations."
    },
    {
        "id": "RS.MA-05.01",
        "description": "The organization's incident response plans define severity levels and associated criteria for initiating response plans and escalating event response to appropriate stakeholders and management levels."
    },
    {
        "id": "RS.AN-03.01",
        "description": "The organization performs a thorough investigation to determine the nature and scope of an event, possible root causes, and the potential damage inflicted."
    },
    {
        "id": "RS.AN-06.01",
        "description": "The organization establishes a risk-based approach and procedures for quarantining systems, conducting investigations, and collecting and preserving evidence per best practices and forensic standards."
    },
    {
        "id": "RS.AN-07.01",
        "description": "Incident-related forensic data is captured, secured, and preserved in a manner supporting integrity, provenance, and evidentiary value."
    },
    {
        "id": "RS.AN-08.01",
        "description": "Available incident information is assessed to determine the extent of impact to the organization and its stakeholders, the potential near- and long-term financial implications, and whether or not the incident constitutes a material event."
    },
    {
        "id": "RS.CO-02.01",
        "description": "The organization's incident response program includes defined and approved escalation protocols, linked to organizational decision levels and communication strategies, including which types of information will be shared, with whom (e.g., the organization's governing authority and senior management), and how information provided to the organization will be acted upon."
    },
    {
        "id": "RS.CO-02.02",
        "description": "In the event of an incident, the organization notifies impacted stakeholders including, as required, government bodies, self-regulatory agencies and/or other supervisory bodies, within required timeframes."
    },
    {
        "id": "RS.CO-02.03",
        "description": "The organization maintains and regularly tests incident response communication procedures, with associated contact lists, call trees, and automatic notifications, to quickly coordinate and communicate with internal and external stakeholders during or following an incident."
    },
    {
        "id": "RS.CO-03.01",
        "description": "The organization ensures that cyber threat intelligence is made available, in a secure manner, to authorized staff with responsibility for the mitigation of cyber risks at the strategic, tactical and operational levels within the organization."
    },
    {
        "id": "RS.CO-03.02",
        "description": "In the event of an incident, the organization shares authorized information, in a defined manner and through trusted channels, to facilitate the detection, response, resumption and recovery of its own systems and those of other partners and critical sector participants."
    },
    {
        "id": "RS.MI-01.01",
        "description": "The organization has established processes to implement vulnerability mitigation plans, involve third-party partners and outside expertise as needed, and contain incidents in a timely manner."
    },
    {
        "id": "RS.MI-02.01",
        "description": "Targeted investigations and actions are taken to ensure that all vulnerabilities, system components, devices, or remnants used or leveraged in an attack (e.g., malware, compromised accounts, open ports, etc.) are removed or otherwise returned to a secure and reliable state, or that plans to address the vulnerabilities are documented."
    },
    {
        "id": "RC.RP-01.01",
        "description": "The organization executes its recovery plans, including incident recovery, disaster recovery, and business continuity plans, during or after an incident to resume operations."
    },
    {
        "id": "RC.RP-02.01",
        "description": "The organization's response plans are used as informed guidance to develop and manage task plans, response actions, priorities, and assignments for responding to incidents, but are adapted as necessary to address incident-specific characteristics."
    },
    {
        "id": "RC.RP-02.02",
        "description": "Recovery plans are executed by first resuming critical services and core business functions, while minimizing any potential concurrent and widespread interruptions to interconnected entities and critical infrastructure, such as energy and telecommunications."
    },
    {
        "id": "RC.RP-03.01",
        "description": "Restoration steps include the verification of backups, data replications, system images, and other restoration assets prior to continued use."
    },
    {
        "id": "RC.RP-04.01",
        "description": "Restoration steps include the verification of data integrity, transaction positions, system functionality, and the operation of security controls by appropriate organizational stakeholders and system owners."
    },
    {
        "id": "RC.RP-05.01",
        "description": "The organization maintains documented procedures for sanitizing, testing, authorizing, and returning systems to service following an incident or investigation."
    },
    {
        "id": "RC.RP-05.02",
        "description": "Business, technology, cybersecurity, and relevant third-party stakeholders confirm that systems, data, and services have been returned to functional and secure states and that a stable operational status has been achieved."
    },
    {
        "id": "RC.RP-06.01",
        "description": "Incident management activities are closed under defined conditions and documentation to support subsequent post-mortem review, process improvement, and any follow-on activities is collected and verified."
    },
    {
        "id": "RC.CO-03.01",
        "description": "The organization timely involves and communicates the recovery activities, procedures, cyber risk management issues to the governing body (e.g., the Board or one of its committees), senior management, incident management support teams, and relevant internal stakeholders."
    },
    {
        "id": "RC.CO-03.02",
        "description": "The organization promptly communicates the status of recovery activities to regulatory authorities and relevant external stakeholders, as required or appropriate."
    },
    {
        "id": "RC.CO-04.01",
        "description": "Pre-established communication plans and message templates, and authorized protocols, contacts, media, and communications, are used to notify and inform the public and key external stakeholders about an incident."
    },
    {
        "id": "EX.DD-01.01",
        "description": "Documented procurement plans are developed for initiatives involving elevated business, technical, or cybersecurity risk in order to establish criteria for the evaluation and selection of a supplier, and any special requirements for organizational preparation, supplier due diligence, and contract terms."
    },
    {
        "id": "EX.DD-01.02",
        "description": "Procurement plans address the inherent risks of the planned activity, to include the complexity of the endeavor in terms of technology, scope, and novelty, and demonstrate that the potential business and financial benefits outweigh the costs to control the anticipated risks."
    },
    {
        "id": "EX.DD-01.03",
        "description": "Procurement plans address expected resource requirements and procedures for ongoing management and monitoring of the selected supplier, contingency plans for supplier non-performance, and specific considerations related to contract termination (e.g., return of data)."
    },
    {
        "id": "EX.DD-02.01",
        "description": "The organization implements procedures, and allocates sufficient resources with the requisite knowledge and experience, to conduct third party due diligence and risk assessment consistent with the procurement plan and commensurate with level of risk, criticality, and complexity of each third-party relationship."
    },
    {
        "id": "EX.DD-02.02",
        "description": "The organization reviews and evaluates the proposed business arrangement, to include the proposed fee structures, incentives, and penalties, proposed staff resources, viability of proposed approaches, and business terms, to ensure that products or services are being obtained at competitive and reasonable costs and terms."
    },
    {
        "id": "EX.DD-02.03",
        "description": "The organization reviews and evaluates documentation, such as financial statements, independent audit reports, pooled/shared assessments, control test reports, SEC filings, and past and pending litigation, to the extent required to determine a prospective critical third party's soundness as a business and the quality and sustainability of its internal controls."
    },
    {
        "id": "EX.DD-02.04",
        "description": "The organization reviews and assesses the prospective third party's controls for managing its suppliers and subcontractors (fourth and nth parties), any proposed role fourth and nth parties will play in delivering the products or services, and any specific fourth- and nth-party controls or alternative arrangements the organization may require to protect its interests."
    },
    {
        "id": "EX.DD-03.01",
        "description": "The organization reviews, evaluates, and risk assesses a prospective critical third party's cybersecurity program, including its ability to identify, assess, monitor, and mitigate its cyber risks; the completeness of its policies and procedures; the strength of its technical and administrative controls; and the coverage of its internal and independent control testing programs."
    },
    {
        "id": "EX.DD-03.02",
        "description": "The organization reviews, evaluates, and risk assesses a prospective critical third party's business continuity program, to include business impact analyses, risk assessments, continuity plans, disaster recovery plans, technology resilience architecture, and response and recovery plans, test plans, and test results."
    },
    {
        "id": "EX.DD-03.03",
        "description": "The organization reviews, evaluates, and risk assesses a prospective critical third party's incident response program, to include monitoring and alerting capabilities, incident reporting procedures and protocols, and capabilities for event analysis, problem resolution, and forensic investigation."
    },
    {
        "id": "EX.DD-04.01",
        "description": "The organization defines and implements procedures for assessing the compatibility, security, integrity, and authenticity of externally-developed or externally-sourced applications, software, software components, and firmware before deployment and upon any major change."
    },
    {
        "id": "EX.DD-04.02",
        "description": "The organization reviews and evaluates any technologies or information systems proposed to support a third party's services or activities, to include compatibility with the organization's technology and cybersecurity architectures, interactions and interfaces with existing systems, security controls, operational management and support requirements, and suitability to the task."
    },
    {
        "id": "EX.CN-01.01",
        "description": "Contracts with suppliers clearly detail the general terms, nature, and scope of the arrangement, to include the distribution of responsibilities between the parties; costs, compensation, reimbursements, incentives, and penalties; service level agreements, performance measures, and benchmarks; responsibilities for providing, receiving, and retaining information; recourse provisions; and the organization's rights to review, monitor, and audit the supplier's activities."
    },
    {
        "id": "EX.CN-01.02",
        "description": "Contracts with suppliers address, as relevant to the product or service, the supplier's requirements for managing its own suppliers and partners (fourth parties) and the risks those fourth parties may pose to the third party and to the organization, to include fourth party due diligence, limitations on activities or geography, monitoring, notifications, liability and indemnifications, etc."
    },
    {
        "id": "EX.CN-01.03",
        "description": "Contracts with suppliers address, as relevant to the product or service, the implications of foreign-based third or fourth parties, to include the relevance of local laws and regulations, access to facilities and data, limitations on cross-border data transfer, and language and time zone management."
    },
    {
        "id": "EX.CN-02.01",
        "description": "The organization's contracts require third-parties to implement minimum technology and cybersecurity management requirements, to maintain those practices for the life of the relationship, and to provide evidence of compliance on an ongoing basis."
    },
    {
        "id": "EX.CN-02.02",
        "description": "Minimum cybersecurity requirements for third-parties include requirements for incident and vulnerability notification, to include the types of events requiring notification, notification timeframes, and escalation protocols."
    },
    {
        "id": "EX.CN-02.03",
        "description": "Contracts with suppliers address, as relevant to the product or service, the supplier's obligation to maintain and regularly test a business continuity program and disaster recovery capability the meets the defined resilience requirements of the organization."
    },
    {
        "id": "EX.CN-02.04",
        "description": "Contracts with suppliers address, as relevant to the product or service, the supplier's obligation to regularly participate in joint and/or bilateral recovery exercises and tests, and to address significant issues identified through recovery testing."
    },
    {
        "id": "EX.MM-01.01",
        "description": "The organization implements procedures, and allocates sufficient resources with the requisite knowledge and experience, to manage and monitor its third-party relationships to a degree and extent commensurate with the risk each third party poses to the organization and the criticality of the third party's products, services, and/or relationship to the organization."
    },
    {
        "id": "EX.MM-01.02",
        "description": "The organization regularly evaluates its third party relationships to determine if changes in the organization's circumstances, objectives, or third party use warrant a change in a third party's risk rating (e.g., a less critical third-party relationship evolves into being a critical relationship)."
    },
    {
        "id": "EX.MM-01.03",
        "description": "The organization monitors for and regularly evaluates changes in a critical third party's business posture that could pose adverse risk to the organization (e.g., financial condition, reputation, adverse news, compliance/regulatory issues, key personnel, business relationships, consumer complaints, etc.)"
    },
    {
        "id": "EX.MM-01.04",
        "description": "The organization regularly assesses critical third party adherence to service level agreements, product specifications, performance metrics, resource level/skill commitments, and quality expectations; addresses performance issues; and exercises contract penalties or credits as warranted."
    },
    {
        "id": "EX.MM-01.05",
        "description": "The organization regularly assesses a critical third party's program and ability to manage its own suppliers and partners (fourth and nth parties) and the risks those fourth and nth parties may pose to the third party and to the organization (e.g., cybersecurity supply chain risk, concentration risk, reputation risk, foreign-party risk, etc.)"
    },
    {
        "id": "EX.MM-01.06",
        "description": "The organization regularly reviews the foreign-based operations and activities of a critical third party, or its critical fourth parties, to confirm contract controls are maintained and compliance requirements are managed."
    },
    {
        "id": "EX.MM-02.01",
        "description": "The organization conducts regular third-party reviews for critical vendors to validate that requisite security and contractual controls are in place and continue to be operating as expected."
    },
    {
        "id": "EX.MM-02.02",
        "description": "A process is in place to confirm that the organization's critical third-party service providers maintain their business continuity programs, conduct regular resiliency testing, and participate in joint and/or bilateral recovery exercises and tests."
    },
    {
        "id": "EX.MM-02.03",
        "description": "The organization collaborates with suppliers to maintain and improve the secure use of products, services, and external connections."
    },
    {
        "id": "EX.TR-01.01",
        "description": "The organization establishes contingencies to address circumstances that might put a vendor out of business or severely impact delivery of services to the organization, sector-critical systems, or the financial sector as a whole."
    },
    {
        "id": "EX.TR-01.02",
        "description": "The organization periodically identifies and tests alternative solutions in case a critical external partner fails to perform as expected."
    },
    {
        "id": "EX.TR-01.03",
        "description": "The organization has a documented third-party termination/exit plan, to include procedures for timely removal of the third-party access, return of data and property, personnel disposition, and transition of services and support."
    },
    {
        "id": "EX.TR-02.01",
        "description": "Upon termination of a third-party agreement, the organization ensures that all technical and security matters (access, connections, etc.), business matters (service, support, and ongoing relationship), property matters (data, physical, and intellectual), and legal matters are addressed in a timely manner."
    }
]
