[
  {
    "id": "siemplify",
    "description": "Siemplify is a security orchestration, automation and response (SOAR) provider that is unified with Google's Chronicle security control to provide an intuitive workbench that enables security teams to manage risk better and reduce the cost of addressing threats."
  },
  {
    "id": "virus_total",
    "description": " VirusTotal analyzes suspicious files, domains, IPs and URLs to detect malware and other breaches, automatically share them with the security community. It's a web-based scanner that utilizes over 70 antivirus scanners and URL/blacklisting services, among other tools, to extract signals from uploaded content. "
  },
  {
    "id": "hybrid_connectivity",
    "description": "Google Cloud Hybrid Connectivity provides several options for connecting to Google Cloud with high-performance, guaranteed uptime, and flexible VPNs."
  },
  {
    "id": "deployment_manager",
    "description": "Google Cloud's Deployment Manager is an infrastructure management service that enables users to build predictable cloud resources using static or dynamic configuration file templates. "
  },
  {
    "id": "confidential_vm_and_compute_engine",
    "description": "Confidential VM includes inline memory encryption to secure processing of sensitive data in memory. This type of virtual machine that uses AMD Secure Encrypted Virtualization to provide encryption of data during processing (e.g., data-in-use encryption). "
  },
  {
    "id": "cloud_logging",
    "description": "Cloud Logging is a fully managed service that allows user to store, search, analyze, monitor, and alert on logging data and events from Google Cloud and Amazon Web Services.  User can collect logging data from over 150 common application components, on-premises systems, and hybrid cloud systems."
  },
  {
    "id": "cloud_hardware_security_module_(hsm)",
    "description": "Google Cloud's Hardware Security Module (HSM) is a security feature available under Google Cloud Key Management Service that allows customers to host encryption keys and perform cryptographic operations in a FIPS 140-2 level 3 certified environment. "
  },
  {
    "id": "certificate_authority_service",
    "description": "Google Cloud Certificate Authority Service (CAS) is a highly available & scalable service that enables you to simplify, automate, and customize the deployment, management, and security of private certificate authorities (CA)."
  },
  {
    "id": "cloud_asset_inventory",
    "description": "Cloud Asset Inventory provides inventory services based on a time series database. Cloud Asset Inventory allows you to search asset metadata, export all asset metadata at a certain timestamp or export event change history during a specific timeframe, monitor asset changes by subscribing to real-time notifications, and analyze IAM policy to find out who has access to what.\n"
  },
  {
    "id": "identity_aware_proxy",
    "description": "Identity Aware Proxy (IAP) includes a number of features that can be used to protect access to Google Cloud hosted resources and applications hosted on Google. IAP lets you establish a central authorization layer for applications accessed by HTTPS, so you can use an application-level access control model instead of relying on network-level firewalls."
  },
  {
    "id": "artifact_registry",
    "description": "Artifact Registry provides a single location for storing and managing your system packages and container images."
  },
  {
    "id": "google_kubernetes_engine",
    "description": "Google Kubernetes Engine (GKE) provides the ability to secure containers across many layers of the stack, to include container images, container runtime, cluster network, and access to cluster API."
  },
  {
    "id": "data_catalog",
    "description": "Google Cloud's Data Catalog enables customers to quickly query cloud assets, identify sensitive data, and automatically tag it for integration with Google Cloud's Data Loss Prevention (DLP) tool. "
  },
  {
    "id": "cloud_ids",
    "description": "Cloud IDS is an intrusion detection service that inspects network traffic and triggers alerts to intrusions, malware, spyware, or other cyber-attacks. Cloud IDS' default ruleset is powered by Palo Alto Network's advanced threat detection technologies and the vendor's  latest set of threat signatures (e.g., antivirus, anti-spyware, or vulnerability signatures). Cloud IDS is dependent on Cloud logging feature to collect network telemetry. Further threat detection rule can be crafted to generate alerts based on network traffic (e.g., PCAP, Netflow)."
  },
  {
    "id": "packet_mirroring",
    "description": "This control is a feature found under Virtual Private Cloud tool that provides users with the ability to duplicate traffic to enable cyber forensic investigations."
  },
  {
    "id": "assured_workloads",
    "description": "Assured Workloads provides Google Cloud customers with the ability to apply security controls to an environment, in support of compliance requirements, without compromising the quality of their cloud experience. Customers should only use Assured Workloads if their Google Cloud use case is actively subject to regulatory compliance.\t"
  },
  {
    "id": "resourcemanager",
    "description": "Google Cloud Platform provides resource containers such as organizations, folders, and projects that allow users to group and hierarchically organize other GCP resources. This hierarchical organization lets users easily manage common aspects of your resources such as access control and configuration settings. Resource Manager enables users to programmatically manage these resource containers."
  },
  {
    "id": "actifio_go",
    "description": "Actifio GO is a Google Cloud backup and disaster recovery offering which enables powerful data protection for Google Cloud and hybrid workloads. Actifio GO supports Google workloads such as Compute Engine and VMware Engine, as well as hybrid workloads like VMware, SAP HANA, Oracle and SQL Server, and others."
  },
  {
    "id": "identityplatform",
    "description": "Identity Platform is a customer identity and access management (CIAM) platform that helps organizations add identity and access management functionality to their applications, protect user accounts, and scale with confidence on Google Cloud."
  },
  {
    "id": "terraform_on_google_cloud",
    "description": "Terraform is an open source tool that lets you provision Google Cloud resources with declarative configuration files—resources such as virtual machines, containers, storage, and networking. Terraform's infrastructure-as-code (IaC) approach supports DevOps best practices for change management, letting you manage Terraform configuration files in source control to maintain an ideal provisioning state for testing and production environments."
  },
  {
    "id": "anthosconfigmanagement",
    "description": "Anthos Config Management enables platform operators to automatically deploy shared environment configurations and enforce approved security policies across Kubernetes clusters on-premises, on GKE, and in other public cloud platforms. It also lets platform admins configure Google Cloud services using the same resource model.\n"
  },
  {
    "id": "web_risk",
    "description": "Web Risk is a Google Cloud service that lets client applications check URLs against Google's constantly updated lists of unsafe web resources. Unsafe web resources include social engineering sites—such as phishing and deceptive sites—and sites that host malware or unwanted software. With the Web Risk, you can quickly identify known bad sites, warn users before they click infected links, and prevent users from posting links to known infected pages from your site."
  },
  {
    "id": "cloud_cdn",
    "description": "Cloud CDN (Content Delivery Network) uses Google's global edge network to serve content closer to users, which accelerates access to websites and applications.\nCloud CDN works with external HTTP(S) Load Balancing to deliver content to users. The external HTTP(S) load balancer provides the frontend IP addresses and ports that receive requests and the backends that respond to the requests."
  },
  {
    "id": "cloud_nat",
    "description": "Cloud NAT (Network Address Translation) lets certain resources without external IP addresses create outbound connections to the internet."
  },
  {
    "id": "beyondcorp_enterprise",
    "description": "A zero trust solution that enables secure access with integrated threat and data protection. It provides secure access to critical applications and services, and increases visibility into unsafe user activity."
  },
  {
    "id": "cloud_identity",
    "description": "Cloud Identity is an Identity as a Service (IDaaS) and enterprise mobility management (EMM) product. It offers the identity services and endpoint administration that are available in Google Workspace as a stand-alone product. As an end-user, Cloud Identity protects user access with multi-factor authentication. As an administrator, one can use Cloud Identity to manage users, apps, and devices from a central location—the Google Admin console."
  },
  {
    "id": "cloud_armor",
    "description": "Cloud Armor protects applications by providing Layer 7 filtering and by scrubbing incoming requests for common web attacks or other Layer 7 attributes to potentially block traffic before it reaches load balanced backend services or backend buckets."
  },
  {
    "id": "endpoint_management",
    "description": "With Google endpoint management, you can make your organization's data more secure across your users' mobile devices, desktops, laptops, and other endpoints."
  },
  {
    "id": "cloudvpn",
    "description": "Cloud VPN securely connects your peer network to your Virtual Private Cloud (VPC) network through an IPsec VPN connection. Traffic traveling between the two networks is encrypted by one VPN gateway and then decrypted by the other VPN gateway. This action protects your data as it travels over the internet. You can also connect two instances of Cloud VPN to each other."
  },
  {
    "id": "cloud_key_management",
    "description": "A cloud-hosted key management service that allows a user manage symmetric and asymmetric cryptographic keys for cloud services the same way one does on-premises. It also manages encryption keys on Google cloud."
  },
  {
    "id": "titan_security_key",
    "description": "The Titan Security Key provides a tamper resistant hardware security key that is used for 2-factor authentication."
  },
  {
    "id": "chronicle",
    "description": "Chronicle is Google Cloud's data aggregation platform and threat detection system designed to collect massive amounts of security telemetry, detect malicious events, and report based on known indicators of compromise. Most of the attacks were correlated using Chronicle's documentation and the threat detection rules available on their GitHub repo."
  },
  {
    "id": "access_transparency",
    "description": "Access Transparency logs record the actions that Google personnel take when accessing customer content. Access Transparency log entries include details such as the affected resource and action, the time of the action, the reason for the action, and information about the accessor."
  },
  {
    "id": "shielded_vm",
    "description": "Shielded VMs are virtual machines (VMs) on Google Cloud hardened by a set of security controls that help defend against rootkits and bootkits. Shielded VMs leverage advanced platform security capabilities such as secure and measured boot, a virtual trusted platform module (vTPM), UEFI firmware, and integrity monitoring."
  },
  {
    "id": "firewalls",
    "description": "Google Cloud VPC Firewalls can allow or deny traffic based on the traffic's protocol, destination ports, sources, and destinations and. VPC firewalls are stateful and exist not only between your instances and other networks, but also between individual instances within the same network. Connections are allowed or denied on a per-instance basis.  Firewall activity can be captured via Firewall rules logging and analyzed with Firewall Insights."
  },
  {
    "id": "security_command_center",
    "description": "Security Command Center (SCC) provides analysts with a centralized dashboard for cyber situational awareness by aggregating threat and vulnerability reports. SCC works by scanning for weaknesses or monitoring an organization's logging stream for anomalies (e.g., Google Workspace logs, containers, vulnerabilities in web applications, and hypervisor-level instrumentation). To further mitigate risks in the infrastructure, SCC easily integrates with other Google Cloud security solutions: Cloud DLP, Chronicle, Binary Authorization, Cloud Armor, and 3rd party solutions (e.g., SIEM, SOAR). The cyber-attacks in this solution are correlated to SCC's premium tier which included additional security features for: Event Threat Detection, Container Threat Detection, Virtual Machine Threat Detection, Web Security Scanner, and Security Health Analytics"
  },
  {
    "id": "cloud_storage",
    "description": "Google's Cloud Storage is an object storage service that provides customers with replication, availability, access control, and data management. A feature to highlight is that Cloud Storage by default always encrypts data before it's written to disk on the server side. "
  },
  {
    "id": "cloud_data_loss_prevention",
    "description": "Cloud DLP provides tools to classify, mask, tokenize, and transform sensitive elements to help you better manage the data that you collect, store, or use for business or analytics."
  },
  {
    "id": "binary_authorization",
    "description": "Binary Authorization is a service that provides software supply-chain security for container-based applications."
  },
  {
    "id": "config_connector",
    "description": "Config Connector is a Kubernetes addon that allows you to manage Google Cloud resources through Kubernetes.\nMany cloud-native development teams work with a mix of configuration systems, APIs, and tools to manage their infrastructure. This mix is often difficult to understand, leading to reduced velocity and expensive mistakes. Config Connector provides a method to configure many Google Cloud services and resources using Kubernetes tooling and APIs."
  },
  {
    "id": "advancedprotectionprogram",
    "description": "The Advanced Protection Program safeguards users with high visibility and sensitive information from targeted online attacks.  Current capabilities include MFA, blocking harmful downloads while using chrome, and prevention of data requests from non-vetted apps.\n\nNew protections are automatically added to defend against today’s wide range of threats."
  },
  {
    "id": "secret_manager",
    "description": "Secret Manager allows you to store, manage, and access secrets as binary blobs or text strings. Secret Manager works well for storing configuration information such as database passwords, API keys, or TLS certificates needed by an application at runtime."
  },
  {
    "id": "virtual_private_cloud",
    "description": "Google Cloud's Virtual Private Cloud (VPC) allows users to logically isolate resources and define security perimeters that filters [ingress and egress] traffic in a virtual network based on user identity or policies for cloud assets (e.g., instance or subnet)."
  },
  {
    "id": "policy_intelligence",
    "description": "Policy Intelligence helps enterprises understand and manage their policies to reduce their risk. By utilizing machine learning and analytics, policy intelligence provides more visibility and automation and  customers can increase their workload."
  },
  {
    "id": "recaptcha_enterprise",
    "description": "With reCAPTCHA Enterprise, you can protect your site from spam and abuse, and detect other types of fraudulent activities on the sites, such as credential stuffing, account takeover (ATO), and automated account creation. reCAPTCHA Enterprise offers enhanced detection with more granular scores, reason codes for risky events, mobile app SDKs, password breach/leak detection, Multi-factor authentication (MFA), and the ability to tune your site-specific model to protect enterprise businesses."
  },
  {
    "id": "vpc_service_controls",
    "description": "VPC Service Controls improves your ability to mitigate the risk of data exfiltration from Google Cloud services such as Cloud Storage and BigQuery. You can use VPC Service Controls to create perimeters that protect the resources and data of services that you explicitly specify."
  },
  {
    "id": "identity_and_access_management",
    "description": "Identity and Access Management (IAM) gives administrators fine-grained access control and visibility for centrally managing enterprise cloud resources. It gives more granular access to specific Google Cloud resources and prevents unwanted access to other resources. IAM lets users adopt the security principle of least privilege, so you grant only the necessary access to your resources."
  },
  {
    "id": "vmmanager",
    "description": "VM Manager is a suite of tools that can be used to manage operating systems for large virtual machine (VM) fleets running Windows and Linux on Compute Engine.\n\nVM Manager helps drive efficiency through automation and reduces the operational burden of maintaining these VM fleets."
  },
  {
    "id": "container_registry",
    "description": "Container Registry is Google Cloud's service that provides a single location for storing and managing container images that support Docker Image Manifest V2 and OCI image formats. Container Analysis is the vulnerability scanning feature in Container Registry that detects software weaknesses from the following sources: Debian, Ubuntu, Alpine, RHEL, CentOS, National Vulnerability Database."
  }
]