[
    {
        "id": "advanced_threat_protection_for_azure_sql_database",
        "description": "Advanced Threat Protection for Azure SQL Database, Azure SQL Managed Instance, Azure Synapse Analytics, SQL Server on Azure VMs and SQL Server enabled by Azure Arc detects anomalous activities indicating unusual and potentially harmful attempts to access or exploit databases."
    },
    {
        "id": "alerts_for_azure_cosmos_db",
        "description": "Azure Cosmos DB alerts are generated by unusual and potentially harmful attempts to access or exploit Azure Cosmos DB accounts. These alerts are triggered based on pre-defined conditions and can be customized."
    },
    {
        "id": "alerts_for_azure_network_layer",
        "description": "Alerts for Azure Network Layer (formerly Azure Alerts for Network Layer) can detect potential issues in Azure network infrastructures. These alerts are triggered by specific conditions related to network traffic, security, and performance. Alerts are triggered based on pre-defined conditions and can be customized."
    },
    {
        "id": "azure_backup",
        "description": "The Azure Backup service provides secure solutions to back up data and recover it from the Microsoft Azure cloud. Azure Backup helps protect critical business systems and backup data by implementing preventive measures and providing tools that protect from attacks to infiltrate systems."
    },
    {
        "id": "azure_ddos_protection",
        "description": "Azure DDoS Protection (formerly Azure DDOS Protection Standard), combined with application design best practices, provides enhanced DDoS mitigation features to defend against DDoS attacks. It is automatically tuned to help protect specific Azure resources in a virtual network."
    },
    {
        "id": "azure_dedicated_hsm",
        "description": "Azure Dedicated HSM is an Azure service that provides cryptographic key storage in Azure. Dedicated HSM meets security requirements for FIPS 140-2 Level 3-validated devices and provides users with complete and exclusive control of the HSM appliance."
    },
    {
        "id": "azure_dns_alias_records",
        "description": "Azure DNS Alias Records are qualifications on a DNS record set that enable DNS records to reference other Azure resources from within a DNS zone. As a result, the alias record set seamlessly updates itself during DNS resolution and can prevent dangling DNS entries."
    },
    {
        "id": "azure_dns_analytics",
        "description": "Azure DNS Analytics helps to identify clients that try to resolve malicious domain names, identify stale resource records, identify frequently queried domain names and talkative DNS clients, view request load on DNS servers, and view dynamic DNS registration failures. The solution collects, analyzes, and correlates Windows DNS analytic and audit logs and other related data from DNS servers."
    },
    {
        "id": "azure_firewall",
        "description": "Azure Firewall is a cloud-native, intelligent network firewall security service that offers threat protection for Azure cloud workloads. It is a fully stateful firewall as a service (FWaaS) with built-in high availability and unlimited cloud scalability."
    },
    {
        "id": "azure_key_vault",
        "description": "Azure Key Vault is a cloud service for securely storing, managing, and accessing secrets, keys, and certificates used throughout Azure and for internally connected resources. It requires proper permissions for authentication and authorization for access and provides monitoring for all activity with the key vault."
    },
    {
        "id": "azure_network_watcher_traffic_analytics",
        "description": "Azure Network Watcher: Traffic Analytics (formerly Azure Network Traffic Analytics) is a cloud-based solution that provides visibility into user and application activity in cloud networks. Traffic analytics analyzes Network Watcher network security group (NSG) flow logs to provide insights into traffic flow in Azure cloud environments and identify security threats to networks, with information such as open ports and applications attempting internet access."
    },
    {
        "id": "azure_policy",
        "description": "Azure Policy enforces organizational standards and assesses compliance for resources in Azure by comparing the properties of those resources to business rules, known as policy definitions. Azure Policy can enforce resource consistency, regulatory compliance, and security."
    },
    {
        "id": "azure_private_link",
        "description": "Azure Private Link enables to access Azure PaaS Services (for example, Azure Storage and SQL Database) and Azure hosted customer-owned/partner services over a private endpoint in the virtual network. Traffic between the virtual network and the service travels the Microsoft backbone network, eliminating exposure to the public internet."
    },
    {
        "id": "azure_role_based_access_control",
        "description": "Azure Role-Based Access Control (Azure RBAC, formerly Role Based Access Control) provides access management for cloud resources. Azure RBAC helps to manage who has access to Azure resources, what they can do with those resources, and which areas they have access."
    },
    {
        "id": "azure_update_manager",
        "description": "Azure Update Manager (formerly Azure Automation Update Management) is a unified service to ensure that the most recent security updates are installed on Windows and Linux virtual machines in Azure, and on-premises or other cloud environments (connected by Azure Arc)."
    },
    {
        "id": "azure_vpn_gateway",
        "description": "Azure VPN Gateway is a service that can be used to send encrypted traffic between an Azure virtual network and on-premises locations over the public Internet. VPN Gateway can also be used to send encrypted traffic between Azure virtual networks over the Microsoft network. "
    },
    {
        "id": "azure_web_application_firewall",
        "description": "Azure Web Application Firewall (WAF) provides centralized protection of web applications from common exploits and vulnerabilities. WAF filters and analyzes incoming HTTP/HTTPS traffic before it reaches web applications to help prevent attacks."
    },
    {
        "id": "defender_for_storage",
        "description": "Microsoft Defender for Cloud: Defender for Storage can detect unusual and potentially harmful attempts to access or exploit storage accounts. Security alerts may trigger due to suspicious access patterns, suspicious activities, and upload of malicious content. Alerts include details of the incident that triggered them, as well as recommendations on how to investigate and remediate threats."
    },
    {
        "id": "docker_host_hardening",
        "description": "The Defender for Servers plan in Microsoft Defender for Cloud identifies unmanaged containers hosted on IaaS Linux VMs, or other Linux machines running Docker containers. The configurations of these Docker hosts are continuously compared with the Center for Internet Security (CIS) Docker Benchmark, with alerts generated if containers do not satisfy a control and security recommendations provided to address findings."
    },
    {
        "id": "just-in-time_vm_access",
        "description": "Microsoft Defender for Cloud: Just-in-Time VM Access protects resources from threat actors actively hunting for machines with open management ports, such as RDP and SSH. It requires specific permissions to request access to virtual machines and provides access only for a specified period of time."
    },
    {
        "id": "microsoft_antimalware_for_azure",
        "description": "Microsoft Antimalware for Azure is a free real-time protection that helps identify and remove viruses, spyware, and other malicious software. It generates alerts when known malicious or unwanted software tries to install itself or run on Azure systems."
    },
    {
        "id": "ai_threat_protection",
        "description": "Microsoft Defender for Cloud's AI Threat Protection identifies threats to generative AI applications in real time and helps respond to security issues. It works with Azure AI Content Safety Prompt Shields and Microsoft's threat intelligence to provide security alerts for threats like data leakage, data poisoning, jailbreak, and credential theft."
    },
    {
        "id": "defender_for_apis",
        "description": "Microsoft Defender for APIs offers lifecycle protection, detection, and response coverage for APIs published in Azure API Management. Usage includes investigation to improve API security posture, prioritize vulnerability fixes, and detect active real-time threats."
    },
    {
        "id": "defender_for_app_service",
        "description": "Microsoft Defender for Cloud: Defender for App Service uses the scale of the cloud to identify attacks targeting applications running over App Service and generate security recommendations based on its findings. It can identify attempts to run high privilege commands, Linux commands on a Windows App Service, fileless attack behavior, digital currency mining tools, and many other suspicious and malicious code execution activities."
    },
    {
        "id": "alerts_for_windows_machines",
        "description": "Alerts for Windows Machines monitors Windows VMs and identifies suspicious activities, such as malicious scripts, unusual logon attempts, or potentially malicious software execution."
    },
    {
        "id": "alerts_for_dns",
        "description": "Alerts for DNS detect and alert on suspicious or anomalous DNS activity in Azure resources. These alerts help identify potential threats like malware communicating with command and control servers, phishing attempts, or data exfiltration through DNS."
    },
    {
        "id": "file_integrity_monitoring",
        "description": "The file integrity monitoring feature in Defender for Servers Plan 2 in Microsoft Defender for Cloud helps to keep enterprise assets and resources secure by scanning and analyzing operating system files, Windows registries, application software, and Linux system files for changes that might indicate an attack."
    },
    {
        "id": "ai_security_recommendations",
        "description": "AI Security Recommendations can be provided in Microsoft Defender for Cloud. The recommendations that appear in an environment are based on the resources being protected and on customized configuration. "
    },
    {
        "id": "alerts_for_linux_machines",
        "description": "Alerts for Linux Machines identifies suspicious activities on Linux machines through collection and aggregation of auditd records in  supported Linux distributions."
    },
    {
        "id": "vulnerability_management",
        "description": "Defender Vulnerability Management is natively integrated within Defender for Cloud to perform vulnerability assessments and recommendations for cloud-based virtual machines."
    },
    {
        "id": "defender_for_containers",
        "description": "Microsoft Defender for Containers is a cloud-native solution to monitor and maintain the security of containerized assets (e.g., Kubernetes clusters, container images), and their applications, across multicloud and on-premises environments."
    },
    {
        "id": "defender_for_open_source_databases",
        "description": "In Microsoft Defender for Cloud, the Defender for Open-Source Relational Databases plan within Defender for Databases detects anomalous activities that indicate unusual and potentially harmful attempts to access or exploit databases."
    },
    {
        "id": "devops_security",
        "description": "DevOps Security in Defender for Cloud helps protect applications and resources from code to cloud across multi-pipeline environments, including Azure DevOps, GitHub, and GitLab. DevOps Security recommendations can be correlated with other contextual cloud security insights to prioritize remediation in code. "
    },
    {
        "id": "defender_for_key_vault",
        "description": "Microsoft Defender for Key Vault detects unusual and potentially harmful attempts to access or exploit Azure Key Vault accounts."
    },
    {
        "id": "defender_for_resource_manager",
        "description": "Microsoft Defender for Resource Manager monitors for suspicious resource management operations and movement performed through the Azure portal, Azure REST APIs, Azure CLI, and other Azure programmatic clients."
    },
    {
        "id": "azure_network_security_groups",
        "description": "Azure Network Security Groups can be used to filter network traffic to and from Azure resources in an Azure virtual network. A network security group contains security rules that allow or deny inbound network traffic to, or outbound network traffic from, several types of Azure resources. For each rule, source and destination, port, and protocol can be specified."
    },
    {
        "id": "defender_for_azure_sql_databases",
        "description": "In Microsoft Defender for Cloud, the Defender for Azure SQL Databases plan within Defender for Databases helps discover and mitigate potential database vulnerabilities. It alerts to anomalous activities that might indicate a threat to databases."
    },
    {
        "id": "microsoft_sentinel",
        "description": "Microsoft Sentinel is a scalable, cloud-native, security information event management (SIEM) and security orchestration automated response (SOAR) solution."
    }
]
